{"/about/":{"data":{"":"This is the about page."},"title":"About"},"/docs/deployment/":{"data":{"":"Information related to self-hosting topics.\nQuick start Configuration Production use Updating"},"title":"Deployment"},"/docs/deployment/bunny-cdn/":{"data":{"":"Note\nUsing Bunny CDN is not required. This is an example of self-hosting Private Captcha behind Bunny CDN . Instructions for other CDN providers will be different, but core ideas are the same.","add-three-type-a-dns-records-for-api-cnd-and-portal#Add three type-A DNS records for \u003ccode\u003eapi.\u003c/code\u003e, \u003ccode\u003ecnd.\u003c/code\u003e and \u003ccode\u003eportal.\u003c/code\u003e":"Three new records in Bunny DNS dashboard Point all 3 records to the same public IPv4 address for your compute resource (VPS server, EC2 instance etc.) and click “Enable CDN acceleration” button for each of them. This will create 3 respective CDN zones which we will configure separately below.","allowing-only-bunny-servers-to-access-your-compute-node#Allowing only Bunny servers to access your compute node":"As a general rule of thumb, you should only allow Bunny’s CDN servers to access your compute resource.","configuring-the-api-cdn-zone#Configuring the \u003ccode\u003eapi.\u003c/code\u003e CDN zone":"Hostnames. Click “Force SSL” both on Bunny proxy and api.mydomain.com address. Origin. If you are using custom certificates for docker-compose setup, use port 443, otherwise use 80 (see above) Pricing \u0026 Routing. Use “High-volume tier” setup. At the time of the writing Bunny has a problem with IPv6 connections on “Standard tier” and only “High-volume tier” does not have this issue. It does reduce the number of points-of-presence but it’s not a substantial problem. (This is a pretty much only Bunny-specific setting in this guide) Caching. Disable “Smart Cache”, “Query string sort”, “Cache error_response” settings. Make sure to use “Respect origin Cache-Control” for Cache expiration time setting. Vary Cache. Enable “Vary cache” by query string and enter sitekey as a parameter.","configuring-the-cdn-cdn-zone#Configuring the \u003ccode\u003ecdn.\u003c/code\u003e CDN zone":"Hostnames. The same as for api. zone above. Origin. The same as for api. zone above. Pricing \u0026 Routing. The same as for api. zone above. Caching. Here you can enable “Smart cache” and few other settings, like “Cache error response”. Vary Cache. Do not enable “Vary cache”. Security. Enable “Block POST requests”.","configuring-the-portal-cdn-zone#Configuring the \u003ccode\u003eportal.\u003c/code\u003e CDN zone":"Hostnames. The same as for api. zone above. Origin. The same as for api. zone above. Pricing \u0026 Routing. The same as for api. zone above. Caching. Here you can enable “Smart cache” and few other settings, but not “Cache error response”. Vary Cache. Enable “Vary cache” by URL query string, but do not enter any specific parameter.","decide-on-https-termination#Decide on HTTPS termination":"In general you have a few options:\nBunny does HTTPS termination for and your Private Captcha instance listens on port 80 (which you will allow in firewall of your server). Traffic between Bunny and your server is not encrypted. This is the default option and does not involve any additional steps. Your only job is to click “Force SSL” and “Get a free certificate” (Let’s Encrypt) in Bunny UI and you are done. Bunny does HTTPS termination and you use self-signed certificates for Private Captcha. Same as the above, but traffic between Bunny and your server is encrypted (albeit potentially vulnerable to MITM attack). Your instance listens on port 443 instead. You can pass certificates to the Private Captcha server using -certfile and -keyfile command line parameters. You use your own certificates all the way, starting from your server. You upload your certificate to Bunny and tell Bunny CDN to verify the certificate origin for you. Certificates can be updated using certbot .","eu-routing#EU routing":"In case you have a “larger” Private Captcha installation (e.g. multi-node Enterprise edition) and you want to restrict routing to be EU-only (meaning, you also have non-EU servers), in Bunny you can achieve that in “Pricing \u0026 Routing” section of the dashboard.","http-headers#HTTP headers":"Additionally you can add a secret request header to each request in Bunny CDN using an “Edge rule” and check this header yourself before accessing Private Captcha instance (for example, if you use Caddy or Nginx as a reverse proxy).","ip-addresses#IP addresses":"Bunny publishes a list of IP addresses/ranges of their servers (both IPv4 and IPv6). While the implementation of this is outside of the scope of this guide, you can have network firewall rules in your cloud provider (e.g. Firewalls in Hetzner, Vultr etc.) that only allow access from Bunny’s IPs. You will have to keep those firewall rules updated to ensure availability of your Private Captcha installation.","network-limits#Network limits":"Per each of the CDN zones above you can setup rate limiting on Bunny side (which is recommended).","point-nameservers-for-your-domain-to-bunny-dns-servers#Point nameservers for your domain to Bunny DNS servers":"For the domain (or subdomain) where you will host your Private Captcha instance, we will need Bunny to manage our DNS. For that we need to point your current domain name registar DNS to Bunny.net. Login to your registar and find DNS section. Inside point your DNS to Bunny’s servers kiki.bunny.net and coco.bunny.net.\nExample of Namecheap DNS configuration","prerequisites#Prerequisites":"Basic version of self-hosted Private Captcha is the single-node docker-compose setup, described in the Quickstart.\nIt is assumed:\nyou are running a single node compute resource (e.g. a VPS in Hetzner/Linode/Scaleway or EC2 instance in AWS) you have setup, configured, and secured your compute node such that for the rest of this guide you have an active shell access (e.g. SSH or “cloud shell” from your provider) your compute node has a public IPv4 address and 80/443 port is exposed publicly in your firewall you have a domain mydomain.com purchased and access to your domain name registar you already did the Quickstart guide, configured your environment variables, SMTP provider etc.","security-optional#Security (optional)":"Warning\nThis is not a comprehensive security guide. Here are only a very few settings, specific to Bunny CDN that you can tweak.","setup-steps#Setup steps":"","waf#WAF":"Bunny now also provides a Web Application Firewall which you can use to block abusers or configure custom rules. Use at your own discretion."},"title":"Bunny CDN"},"/docs/deployment/configuration/":{"data":{"":"","environmental-variables#Environmental variables":"","optional#Optional":"Variable Example Description PC_HOST localhost Host where to listen for HTTP connections. PC_PORT 8080 Port where to listen for HTTP connections. PC_LOCAL_ADDRESS localhost:9090 Local “admin” endpoint that hosts Prometheus metrics, manual maintenance jobs triggers (requires PC_LOCAL_API_KEY to work) and kubernetes liveness/readiness probes. Must not be exposed publicly. PC_LOCAL_API_KEY asdf... A non-empty API key required to access PC_LOCAL_ADDRESS maintenance jobs “admin” functionality PC_RATE_LIMIT_HEADER X-Real-Ip HTTP header which will contain IP address of the connecting user. Is expected to come from CDN or proxy (e.g., nginx, caddy). If empty, righmost non-private address of X-Forwarded-For will be used. PC_RATE_LIMIT_RPS 1.0 Leak rate per second (float) of default API rate limiter. PC_RATE_LIMIT_BURST 20 Burst of default API rate limiter. PC_CLICKHOUSE_ADMIN captcha_admin Separate username for ClickHouse to run migrations with. If empty, PC_CLICKHOUSE_USER will be used. PC_CLICKHOUSE_ADMIN_PASSWORD qwerty12345 Password for PC_CLICKHOUSE_ADMIN. PC_POSTGRES_ADMIN captcha_admin Separate username for Postgres to run migrations with. If empty, PC_POSTGRES_USER (or PC_POSTGRES) will be used. PC_POSTGRES_ADMIN_PASSWORD qwerty12345 Password for PC_POSTGRES_ADMIN. PC_MAINTENANCE_MODE true Boolean (1, y, true) value if server is in maintenance mode, during which communications with databases are offline, but APIs (and cache) are functional. PC_REGISTRATION_ALLOWED true Boolean (1, y, true) value if this instance of PrivateCaptcha has registration page open. PC_HEALTHCHECK_INTERVAL 60 Integer value that defines how frequently in seconds we perform internal health check of DB instances and http server. Defaults to 5 in prod and 60 in dev. PC_VERBOSE true Boolean (1, y, true) to indicate verbose logging (trace level). PC_COUNTRY_CODE_HEADER CDN-RequestCountryCode HTTP header with 2-letter country code (usually comes from your CDN provider) EE_AUDIT_LOGS_DAYS 365 Enterprise-only config for retention period of audit log history (defaults to 365) Note\n“Default” rate limiter means the one for public APIs (/puzzle, /verify and some others). Various other APIs have pre-configured hardcoded limits, compiled in.\nWarning\nIt’s not recommended to modify leak rate configuration unless you really know what you’re doing.","required#Required":"Variable Example Description STAGE prod Stage is used for building widget js code (e.g. minification) and for separation in logging. PC_PORTAL_BASE_URL portal.yourdomain.com (Sub)domain where you will host PrivateCaptcha portal. PC_API_BASE_URL api.yourdomain.com (Sub)domain where CAPTCHA API (puzzles, verification etc.) will be hosted. PC_CDN_BASE_URL cdn.yourdomain.com (Sub)domain where CDN assets will be hosted (e.g., client-side widget package, pictures, email assets etc.). PC_ADMIN_EMAIL admin@yourdomain.com Email that will be used for admin user to login. Must be valid and functioning. PC_EMAIL_FROM no-reply@yourdomain.com Sender address for various transactional emails (2FA auth, welcome email etc.) PC_POSTGRES postgres://username:pass@postgres:5432/privatecaptcha Postgres connection string for backend DB. You can also specify separate values (see note below). PC_CLICKHOUSE_HOST clickhouse Host (or IP address) where ClickHouse DB is running. PC_CLICKHOUSE_DB privatecaptcha Database for connecting to ClickHouse. PC_CLICKHOUSE_USER captcha Username for connecting to PC_CLICKHOUSE_DB. PC_CLICKHOUSE_PASSWORD qwerty12345 Password for PC_CLICKHOUSE_USER. PC_USER_FINGERPRINT_KEY abcdef... HEX-encoded 64-character string, used as IV value for hashing user fingerprints. PC_API_SALT asdf... String used as salt for creating puzzle signatures. PC_XSRF_KEY jkl;... String used as XSRF key for signing tokens PC_ID_HASH_SALT abcd... String used as salt for obscuring internal IDs in URLs (is actually optional, but recommended) SMTP_ENDPOINT smtp://your.provider.com:587 Endpoint used for sending transactional email. SMTP_USERNAME foobar Username for SMTP_ENDPOINT. SMTP_PASSWORD qwerty12345 Password for SMTP_USERNAME. Note\nInstead of PC_POSTGRES as a connection string, you can specify PC_POSTGRES_HOST, PC_POSTGRES_DB, PC_POSTGRES_USER, PC_POSTGRES_PASSWORD separately."},"title":"Configuration"},"/docs/deployment/production/":{"data":{"":"","backups#Backups":"While it is outside of the scope of this note, there’re many solutions that add a docker container to the compose stack to backup databases to S3-compatible storage. In order to add them, you can use compose.override.yml file.","cdn-integration#CDN integration":"All responses from Private Captcha server already contain correct Cache-Control headers so your only job is to make sure CDN/proxy respects them and does not override them. Private Captcha installation expects to be running on 3 subdomains (cdn., api. and portal.) and it is meant to be behind a reverse proxy and/or CDN (in other words, not directly connected to the internet). It is expected to cache captcha script, portal assets (e.g. for emails) and test puzzle API requests on CDN of your choice.\nYou can find an example for Bunny CDN in the docs.","enterprise-edition#Enterprise edition":"There are a few changes you will need to make using a compose.override.yml file, namely replace privatecaptcha image to privatecaptcha-ee and set an additional environment variable EE_LICENSE_KEY (which you should put in the .env file).\nservices: privatecaptcha: image: ghcr.io/privatecaptcha/privatecaptcha-ee:latest environment: - EE_LICENSE_KEY=${EE_LICENSE_KEY} migration: image: ghcr.io/privatecaptcha/privatecaptcha-ee:latest","https#HTTPS":"As you can see, it’s possible to use -certifle and -keyfile to force HTTPS (by default server handles plain HTTP and expects an external proxy to handle TLS/SSL termination).","migrations#Migrations":"If you use docker compose based setup, you can skip this. Below information is only relevant for “large” custom installations. While in docker compose single-node setup migrations have been taken care of, if you run larger installation of Private Captcha with separate DB and server nodes, you might want to run migrations manually.\nTo run migration manually it’s required to pass -mode migrate and -migrate-hash (for example with value $(git rev-list -1 HEAD)) to server binary. If you also use -env stdin you can pipe secrets into it.\ncat secrets.env | bin/server -mode migrate -migrate-hash=$(git rev-list -1 HEAD) -env stdin","monitoring#Monitoring":"Prometheus metrics (/metrics endpoint) are available on $PC_LOCAL_ADDRESS address (if you set PC_LOCAL_ADDRESS environment variable). Server exposes “standard” Go metrics and “four golden signals” metrics as well as few custom platform and business logic-specific metrics.\nAdditionally there’re /live and /ready endpoints available on $PC_LOCAL_ADDRESS address that can be used if you run Private Captcha on Kubernetes cluster.","security#Security":"If you’re running Private Captcha in production, security is completely your responsibility. It is a very large topic and completely outside the scope of this note. Some very basic advice, specific to Private Captcha server itself:\nupdate Private Captcha server frequently make sure server is behind CDN/proxy and is not directly connected to the internet do not expose public port from docker container, keep it listening on localhost and use Nginx/Caddy (Docker has it’s own security issues) do not enable registration if you’re the only admin/user (PC_REGISTRATION_ALLOWED is empty/unset by default) you can configure CDN/reverse proxy rate limits accordingly to your use-case (that is, in addition to rate limit configuration of Private Captcha server itself) correct rate limiting of Private Captcha server itself is heavily dependent on correct configuration of PC_RATE_LIMIT_HEADER environment variable (which value is expected to come from proxy/CDN) if you run a larger installation with separate DB and server nodes, you need to secure network between them (docker compose single node setup does not use encryption for Postgres or ClickHouse connections) for single-node installations, if you can, use Podman or rootless Docker","servers-command-line-options#Server\u0026rsquo;s command-line options":"-certfile string certificate PEM file (e.g. cert.pem) -env string Path to .env file, 'stdin' or empty -keyfile string key PEM file (e.g. key.pem) -migrate-hash string Target migration version (git commit) -mode string migrate | server | auto -version Print version and exit NOTE: Mode auto migrates databases and then runs server - usually done separately - so that you don’t need a separate migration container. This is not recommended for production use as by default Private Captcha uses different database permissions for migrations and normal use.","updates#Updates":"Before bumping docker tag you need to read upgrade instructions for each version. You should monitor updates (new docker tags) and update frequently. Updates are meant to be backwards compatible and bring fixes, including security. There currently is no built-in update notification mechanism.\nWhen you update Private Captcha you also need to purge CDN/proxy caches.\nAlways check upgrade instructions before applying updates."},"title":"Production use"},"/docs/deployment/quickstart/":{"data":{"1-clone-the-self-hosting-repo#1. Clone the self-hosting repo":"Self-hosting repository contains a Docker-based quickstart template.\ngit clone https://github.com/PrivateCaptcha/self-hosting.git private-captcha cd private-captcha","2-create-env-file#2. Create \u003ccode\u003e.env\u003c/code\u003e file":"Copy sample environment variables and set all required ones.\ncp .env.example .env $EDITOR .env Some notes on environment variables:\nPrivate Captcha assumes to run on 3 subdomains in total: api., cdn. and portal. PC_USER_FINGERPRINT_KEY you can generate using openssl rand -hex 64 PC_ADMIN_EMAIL will be used to create an actual admin account (see note for local use below) PC_RATE_LIMIT_HEADER should be the header containing an actual client IP (comes from your CDN or reverse proxy, for example X-Real-Ip) You can find full documentation on these and other required environment variables here.\nTips for local use To run Private Captcha only locally, use privatecaptcha.local:8080 instead of yourdomain.com. To make it work, you need to add a few lines to /etc/hosts file:\n127.0.0.1 portal.privatecaptcha.local 127.0.0.1 api.privatecaptcha.local 127.0.0.1 cdn.privatecaptcha.local NOTE: email with .local domain is not a valid RFC-5322 address, so for 2FA code (required for login) you will need to find “two factor code” from docker logs manually\n(optional) Expose public port By default Private Captcha server executable is listening on http://localhost:8080. If you want to use Docker networking for production directly (which is not recommended) instead of reverse proxy like Nginx or Caddy, you can create a compose.override.yml file like this:\nservices: privatecaptcha: ports: - 8080:8080","3-run-the-stack#3. Run the stack":"docker compose up","4-navigate-to-the-portal#4. Navigate to the Portal":"Now you can open $PC_PORTAL_BASE_URL (e.g. portal.yourdomain.com or http://portal.privatecaptcha.local:8080 ) in browser and log in.\nNOTE: For local-only use, when asked for a verification code, you might need to find it in the logs of privatecaptcha container. Search for “two factor code”.","prerequisites#Prerequisites":"Docker installed (optional) Reverse proxy like Caddy or Nginx Domain name yourdomain.com (for local-only installs, use privatecaptcha.local) Transactional email provider with SMTP credentials (required for production) At least 2GB of RAM","quick-start#Quick start":"Quick start"},"title":"quickstart"},"/docs/deployment/updating/":{"data":{"":"","generic-instructions#Generic instructions":"Backward compatibility is kept on the level of public APIs of Private Captcha, not service configuration itself. It is your responsibility to check for any and all changes before applying updates. It is not recommended to use something like a now-dead Watchtower or any other solution that automatically bumps tag versions. Before each update make sure to backup your data in case you’re using any backup solutions. For this guide it is assumed you are using the self-hosting repository setup.\n(optional) Make backups if you’re using any backup solution. Navigate to the repo cd /path/to/the/self-hosting/repo/checkout Pull latest changes git pull Pull new images docker compose pull Check which version is currently running docker compose ps Perform all instructions below for each version between running version and the one you’re about to upgrade to. Changes in files to look out for: compose.yml, .env.example Recreate containers with new images docker compose up -d","notable-deployment-changes#Notable deployment changes":"","v0016#v0.0.16":"a new mandatory environment variable has to be added: PC_XSRF_KEY (which does what it says on the box)","v0021#v0.0.21":"widget has been updated, purge your CDN cache","v0022#v0.0.22":"a new highly recommended (albeit non-mandatory) environment variable has to be added: PC_ID_HASH_SALT (used to obscure internal IDs in URLs) in case you’re monitoring Private Captcha with Prometheus-compatible agent, a new metric has been added: fine_http_error_total with dimensions code, method, service, handler. This is the metric for “soft” internal errors happening in Portal.","v0023#v0.0.23":"a new environment variable can be added: PC_COUNTRY_CODE_HEADER (a header from CDN provider with 2-letter country code). Usual suspects are: Bunny CDN (CDN-RequestCountryCode), CloudFlare (CF-IPCountry), AWS CloudFront (CloudFront-Viewer-Country)","v0024#v0.0.24":"widget has been updated, purge your CDN cache a new environment variable is available for Enterprise edition: EE_AUDIT_LOGS_DAYS (retention period in days for audit logs)","v0026#v0.0.26":"widget has been updated, purge your CDN cache if you’re monitoring Private Captcha with Prometheus-compatible agent, a new metric has been added: fine_api_error_total with dimensions code, method, service, handler. This is the metric for platform API errors.","v1281#v1.28.1":"NOTE: Versioning now follows semver logic so this release v1.28.x follows v0.0.27 practically speaking\nPostgres major version increase to 18 and ClickHouse to 25 in docker compose stack. Make sure to backup your data before updating! widget has been updated, purge your CDN cache if you’re monitoring Private Captcha with Prometheus-compatible agent: a new metric has been added: server_platform_drop_total with dimension type (specifies amount of internal events dropped due to concurrency pressure) ClickHouse health metric name was changed to server_platform_health_clickhouse for consistency with Postgres version (previous prefix was portal_platform_) for all HTTP metrics dimension label was changed to method (typo fixed)"},"title":"Updating"},"/docs/getting-started/":{"data":{"":"Before integrating Private Captcha into your application, you need to complete a few setup steps in the Private Captcha Portal .","copy-and-store-your-api-key#Copy and store your API key":"After creation, the API key value will be displayed. Copy it immediately and store it securely (e.g., in a password manager).\nWarning\nThe API key value is only shown once. If you lose it, you’ll need to create a new API key. Store it securely and never commit it to version control.","create-a-new-api-key#Create a new API key":"API keys are used for server-side verification of CAPTCHA solutions. Each API key has an expiration date and can be revoked at any time.\nGo to API key settings and click “Create new key”. Give it a meaningful name (e.g., “Production API key”, “WordPress API key”), and select scope Captcha verification (default).\nMake sure to select scope 'Captcha verification' Set an expiration date and click “Create”.","create-a-new-property-in-private-captcha-portal#Create a new property in Private Captcha portal":"A property represents a single CAPTCHA widget that can be used on a website, web page, or form. Each property is identified by a unique Sitekey.\nGo to Private Captcha Portal and click “Add new property”.\nEnter a name for your property (e.g., “My Website”) and the domain where you’ll use the CAPTCHA (e.g., example.com).\nWarning\nThe domain should exactly match your website domain. For local development, you’ll need to enable “Allow localhost” in property settings later.\nClick “Create” to complete property creation.","next-steps#Next steps":"Now that you have a property with a Sitekey (for client-side widget) and an API key (for server-side verification), you can proceed to:\nEnd-to-end exampleFollow along to see a complete integration example IntegrationsUse one of the SDKs for server-side verification Widget customizationIntegrate the widget on your frontend","note-sitekey-of-the-property#Note Sitekey of the property":"After creating the property, you’ll be presented with an integration snippet. The Sitekey is visible in the widget configuration.\nAlternatively, you can find it later by opening your property in the portal, going to the “Integrations” tab, and noting the Sitekey value.\nThe Sitekey looks like aaaaaaaabbbbccccddddeeeeeeeeeeee and is used for the client-side widget initialization.","prerequisites#Prerequisites":"A Private Captcha account (sign up if you don’t have one)","setup-steps#Setup steps":""},"title":"Getting started"},"/docs/integrations/":{"data":{"":"It is recommended to use one of the pre-built integrations. They use a more efficient API than reCAPTCHA-compatible /siteverify API, include retry mechanism and are officially supported. If you cannot find an integration you need, please get in touch.\nAll server- and client-side integrations are not code-generated from OpenAPI/Swagger and instead are created independently to use optimal and idiomatic code for each platform/technology.\nWordPressWordPress plugin All-in-one GoServer-side Golang library Server-side PHPServer-side PHP library Server-side PythonServer-side Python library Server-side .NETServer-side .NET/C# library Server-side RubyServer-side Ruby library Server-side JavaScriptServer-side JavaScript library Server-side ReactClient-side captcha component Client-side JavaServer-side Java library Server-side OpenAPIOpenAPI/Swagger API definition Server-side"},"title":"Integrations"},"/docs/integrations/dotnet/":{"data":{"":"To use this integration you need to create an API key in your account. If you have a working reCAPTCHA integration, check our migration guide for easy instructions. This is a server-side SDK, which you would use to verify captcha solution against Private Captcha API. This SDK does not solve puzzles on the client side (used to protect APIs).\nGitHub repository NuGet package","aspnet-core-middleware#ASP.NET Core middleware":"For web applications, the most convenient way to protect your endpoints is by using the provided middleware. It automatically intercepts POST requests with form data and verifies the CAPTCHA solution.\n1. Register PrivateCaptchaClient for Dependency Injection\nIn your Program.cs (for .NET 6+ minimal APIs) or Startup.cs, register the PrivateCaptchaClient.\n// Program.cs using PrivateCaptcha; var builder = WebApplication.CreateBuilder(args); builder.Services.AddSingleton(sp =\u003e { var config = new PrivateCaptchaConfiguration { ApiKey = \"YOUR_API_KEY\" }; return new PrivateCaptchaClient(config); }); 2. Add the Middleware to the Request Pipeline\nAdd app.UsePrivateCaptcha() to your request pipeline. It should be placed before the endpoints you want to protect.\nvar app = builder.Build(); // ... other middleware // Use the PrivateCaptcha middleware. This will automatically check POST requests // with a form content type for a valid captcha solution. app.UsePrivateCaptcha(); // This endpoint will now be protected by the CAPTCHA middleware. app.MapPost(\"/register\", () =\u003e \"Registration successful!\"); app.Run(); If verification fails, the middleware will short-circuit the request and return a 403 Forbidden status code by default (can be changed in the configuration).","basic-verification#Basic verification":"To verify a CAPTCHA solution, instantiate PrivateCaptchaClient with your configuration and call VerifyAsync.\nvar config = new PrivateCaptchaConfiguration { ApiKey = \"YOUR_API_KEY\" }; var captchaClient = new PrivateCaptchaClient(config); var result = await captchaClient.VerifyAsync(new VerifyInput { Solution = captchaSolution }); if (result.OK()) { Console.WriteLine(\"Captcha verification succeeded!\"); } else { // Verification failed, you can check the reason. Console.WriteLine($\"Verification failed: {result.GetErrorMessage()}\"); }","client-options#Client options":"Property Description Default Value ApiKey (Required) Your API key from the Private Captcha dashboard. string.Empty Domain The API domain to use (use Domains.EU or an override in case of self-hosting) Domains.Global FormField The name of the form field containing the CAPTCHA solution. Used by the middleware. \"private-captcha-solution\" FailedStatusCode The HttpStatusCode to return when middleware verification fails. HttpStatusCode.Forbidden (403) HttpClient An optional HttpClient instance. If not provided, a new one will be created and managed by the client. null","configuration#Configuration":"You can customize the client’s behavior by passing a PrivateCaptchaConfiguration object to the constructor.","error-handling#Error handling":"VerifyOutput: The VerifyAsync method returns a VerifyOutput object. Check the Success property to see if verification passed. If Success is false, the Code property and GetErrorMessage() method provide more details. VerificationFailedException: Thrown when the client cannot get a definitive success/fail response from the API after all retry attempts. This typically indicates a network issue. ArgumentException: Thrown by VerifyAsync if the provided VerifyInput.Solution is null or empty.","installation#Installation":"You can install the package via the .NET CLI or the NuGet Package Manager Console.\n.NET CLI\ndotnet add package PrivateCaptcha Package Manager Console\nInstall-Package PrivateCaptcha","non-standard-backend-domains#Non-standard backend domains":"For EU isolation, you can use built-in constant Domains.EU:\nvar config = new PrivateCaptchaConfiguration { ApiKey = \"YOUR_API_KEY\", Domain = Domains.EU }; var client = new PrivateCaptchaClient(config);","retry-configuration#Retry configuration":"When verifying puzzle solutions, you can also specify some retry and backoff options.\nvar input = new VerifyInput { Solution = \"captcha-solution\", MaxBackoffSeconds = 30, MaxAttempts = 10 };","usage#Usage":"Always check our security recommendations when using this integration. Note\nBefore using this SDK, you’ll need an API key. If you don’t have one yet, see how to create it in the Getting Started guide."},"title":".NET"},"/docs/integrations/go/":{"data":{"":"To use this integration you need to create an API key in your account. If you have a working reCAPTCHA integration, check our migration guide for easy instructions. This is a server-side SDK, which you would use to verify captcha solution against Private Captcha API. This SDK does not solve puzzles on the client side (used to protect APIs).\nGitHub repository","configuration#Configuration":"Client configuration allows to set default form field, domain (can be used for self-hosting or EU isolation) and HTTP status for middleware version.","import-and-instantiation#Import and instantiation":"Add import:\nimport pc \"github.com/PrivateCaptcha/private-captcha-go\" Create the client:\nclient, err := pc.NewClient(pc.Configuration{APIKey: \"pc_abcdef\"}) // ... handle err Configuration object allows to switch to EU endpoint, specify default form field for the solution, HTTP client, and status code for middleware version.","installation#Installation":"go get -u github.com/PrivateCaptcha/private-captcha-go","non-standard-backend-domains#Non-standard backend domains":"For EU isolation, you can use built-in constant EUDomain:\nclient, err := pc.NewClient(pc.Configuration{Domain: pc.EUDomain}) // ... handle err For self-hosted installation, use API domain name.","retry-configuration#Retry Configuration":"When verifying puzzle solutions, you can also specify some retry and backoff options.\ninput := pc.Configuration{ Solution: \"solution\", MaxBackoffSeconds: 10, Attempts: 10, } output, err := client.Verify(ctx, input) // ... handle err","simple-http-middleware#Simple HTTP middleware":"VerifyFunc() is a basic HTTP middleware that returns http.StatusForbidden (configured via Configuration object for client instance) if the captcha solution is not verified.\nmux.Handle(\"POST /my/form\", client.VerifyFunc(actualHandler))","usage#Usage":"Always check our security recommendations when using this integration. Note\nBefore using this SDK, you’ll need an API key. If you don’t have one yet, see how to create it in the Getting Started guide.","verify-solution-directly#Verify solution directly":"Verify() supports automatic backoff and retrying (configured via VerifyInput parameter), enabled by default. You need to check the captcha verification status yourself.\noutput, err := client.Verify(ctx, pc.VerifyInput{Solution: solution}) // ... handle err if !output.OK() { fmt.Printf(\"Captcha verification failed. Error: %s\", result.Error()) }","wrapper-around-http-request#Wrapper around HTTP request":"VerifyRequest() operates on the http.Request level, extracts and verifies form field, configured via Configuration object for the client instance, with standard defaults. You only need to check if the err == nil.\nfunc handler(w http.ResponseWriter, r *http.Request) { if err := client.VerifyRequest(r.Context(), r); err != nil { return } }"},"title":"Go"},"/docs/integrations/java/":{"data":{"":"To use this integration you need to create an API key in your account. If you have a working reCAPTCHA integration, check our migration guide for easy instructions. This is a server-side SDK, which you would use to verify captcha solution against Private Captcha API. This SDK does not solve puzzles on the client side (used to protect APIs).\nGitHub repository Maven package","basic-verification#Basic Verification":"import com.privatecaptcha.*; PrivateCaptchaClient client = new PrivateCaptchaClient( new PrivateCaptchaConfiguration(\"pc_your_api_key\") ); try { VerifyOutput output = client.verify(new VerifyInput(solution)); if (output.ok()) { System.out.println(\"Verification successful!\"); } else { System.out.println(\"Verification failed: \" + output.getErrorMessage()); } } catch (PrivateCaptchaHttpException e) { System.err.println(\"HTTP error: \" + e.getStatusCode()); } catch (VerificationFailedException e) { System.err.println(\"Verification failed after \" + e.getAttempts() + \" attempts\"); }","client-options#Client options":"import java.time.Duration; PrivateCaptchaConfiguration config = new PrivateCaptchaConfiguration(\"pc_your_api_key\") .setDomain(Domains.GLOBAL) .setFormField(\"private-captcha-solution\") .setFailedStatusCode(403) .setConnectTimeout(Duration.ofSeconds(10)) .setReadTimeout(Duration.ofSeconds(30)); PrivateCaptchaClient client = new PrivateCaptchaClient(config);","configuration#Configuration":"","gradle#Gradle":"Add the following to your build.gradle:\nimplementation 'com.privatecaptcha:private-captcha-java:0.0.1'","installation#Installation":"Minimum supported Java version is 11","javalin#Javalin":"app.post(\"/submit-form\", ctx -\u003e { try { VerifyOutput output = captchaClient.verifyRequest(ctx::formParam); if (!output.ok()) { ctx.status(captchaClient.getFailedStatusCode()) .result(\"Captcha verification failed\"); return; } ctx.result(\"Form submitted successfully!\"); } catch (Exception e) { ctx.status(captchaClient.getFailedStatusCode()) .result(\"Captcha verification error\"); } });","maven#Maven":"Add the following dependency to your pom.xml:\ncom.privatecaptcha private-captcha-java 0.0.1","server-integration#Server Integration":"The verifyRequest() method provides easy integration with any HTTP server framework using the FormParameterExtractor functional interface:","servlet-jakartajavax#Servlet (Jakarta/Javax)":"@WebServlet(\"/submit-form\") public class FormServlet extends HttpServlet { private final PrivateCaptchaClient captchaClient = new PrivateCaptchaClient( new PrivateCaptchaConfiguration(System.getenv(\"PC_API_KEY\")) ); @Override protected void doPost(HttpServletRequest request, HttpServletResponse response) throws ServletException, IOException { try { VerifyOutput output = captchaClient.verifyRequest(request::getParameter); if (!output.ok()) { response.sendError(captchaClient.getFailedStatusCode(), \"Captcha verification failed: \" + output.getErrorMessage()); return; } // Process the form... response.getWriter().println(\"Form submitted successfully!\"); } catch (Exception e) { response.sendError(captchaClient.getFailedStatusCode(), \"Captcha verification error\"); } } }","spring-mvc#Spring MVC":"@RestController public class FormController { private final PrivateCaptchaClient captchaClient = new PrivateCaptchaClient( new PrivateCaptchaConfiguration(System.getenv(\"PC_API_KEY\")) ); @PostMapping(\"/submit-form\") public ResponseEntity\u003cString\u003e submitForm(HttpServletRequest request) { try { VerifyOutput output = captchaClient.verifyRequest(request::getParameter); if (!output.ok()) { return ResponseEntity.status(captchaClient.getFailedStatusCode()) .body(\"Captcha verification failed: \" + output.getErrorMessage()); } return ResponseEntity.ok(\"Form submitted successfully!\"); } catch (Exception e) { return ResponseEntity.status(captchaClient.getFailedStatusCode()) .body(\"Captcha verification error\"); } } }","spring-webflux#Spring WebFlux":"@RestController public class FormController { private final PrivateCaptchaClient captchaClient = new PrivateCaptchaClient( new PrivateCaptchaConfiguration(System.getenv(\"PC_API_KEY\")) ); @PostMapping(\"/submit-form\") public Mono\u003cResponseEntity\u003cString\u003e\u003e submitForm(ServerWebExchange exchange) { return exchange.getFormData().map(formData -\u003e { try { VerifyOutput output = captchaClient.verifyRequest(formData::getFirst); if (!output.ok()) { return ResponseEntity.status(captchaClient.getFailedStatusCode()) .body(\"Captcha verification failed\"); } return ResponseEntity.ok(\"Form submitted successfully!\"); } catch (Exception e) { return ResponseEntity.status(captchaClient.getFailedStatusCode()) .body(\"Captcha verification error\"); } }); } }","usage#Usage":"Always check our security recommendations when using this integration. Note\nBefore using this SDK, you’ll need an API key. If you don’t have one yet, see how to create it in the Getting Started guide.","verification-input-options#Verification Input Options":"VerifyInput input = new VerifyInput(solution) .setSitekey(\"your-sitekey\") .setMaxBackoffSeconds(20) .setMaxAttempts(5); VerifyOutput output = client.verify(input);","vertx#Vert.x":"router.post(\"/submit-form\").handler(ctx -\u003e { try { VerifyOutput output = captchaClient.verifyRequest(ctx.request()::getParam); if (!output.ok()) { ctx.response() .setStatusCode(captchaClient.getFailedStatusCode()) .end(\"Captcha verification failed\"); return; } ctx.response().end(\"Form submitted successfully!\"); } catch (Exception e) { ctx.response() .setStatusCode(captchaClient.getFailedStatusCode()) .end(\"Captcha verification error\"); } });"},"title":"Java"},"/docs/integrations/javascript/":{"data":{"":"To use this integration you need to create an API key in your account. If you have a working reCAPTCHA integration, check our migration guide for easy instructions. This is a server-side SDK, which you would use to verify captcha solution against Private Captcha API. This SDK does not solve puzzles on the client side (used to protect APIs).\nGitHub repository NPM package","basic-verification#Basic Verification":"verify() supports automatic backoff and retrying (configured via VerifyInput parameter), enabled by default. You need to check the captcha verification status yourself.\nimport { createClient } from 'private-captcha-js'; const client = createClient({ apiKey: 'your-api-key' }); const result = await client.verify({ solution: 'captcha-solution-from-client' }); if (result.ok()) { console.log('Captcha verified!'); }","client-options#Client Options":"const client = createClient({ apiKey: 'your-api-key', // Required formField: 'private-captcha-solution', // Field from where to read the solution failedStatusCode: 403, // HTTP status code for failed verifications (middleware) domain: 'api.eu.privatecaptcha.com' // Override for EU isolation or for self-hosting });","configuration#Configuration":"Client configuration allows to set default form field, domain (can be used for self-hosting or EU isolation) and HTTP status for middleware version.","expressjs-middleware#Express.js Middleware":"middleware() returns a basic Express.js middleware that extracts and verifies form field, configured via Configuration object for the client instance.\nimport express from 'express'; import { createClient } from 'private-captcha-js'; const app = express(); app.use(express.urlencoded({ extended: true })); // Required const client = createClient({ apiKey: 'your-api-key' }); // Protect route with middleware app.post('/submit', client.middleware(), (req, res) =\u003e { res.send('Form submitted successfully!'); }); // Or verify manually app.post('/verify', async (req, res) =\u003e { try { const result = await client.verifyRequest(req); res.json({ success: result.success }); } catch (error) { res.status(403).json({ error: error.message }); } });","installation#Installation":"npm install private-captcha-js","non-standard-backend-domains#Non-standard backend domains":"For EU isolation, you can use the domain option:\nconst client = createClient({ apiKey: 'your-api-key', domain: 'api.eu.privatecaptcha.com' // EU domain });","retry-configuration#Retry Configuration":"When verifying puzzle solutions, you can also specify some retry and backoff options.\nclient.verify({ solution: 'solution', maxBackoffSeconds: 10, attempts: 10 });","usage#Usage":"Always check our security recommendations when using this integration. Note\nBefore using this SDK, you’ll need an API key. If you don’t have one yet, see how to create it in the Getting Started guide."},"title":"JavaScript"},"/docs/integrations/openapi/":{"data":{"":"You can use our OpenAPI specification file for exploring API or generating missing or custom integrations. For example, this is one of the most popular open-source tools to generate an API client.\nClick here for an OpenAPI (Swagger) playground link."},"title":"OpenAPI"},"/docs/integrations/php/":{"data":{"":"To use this integration you need to create an API key in your account. If you have a working reCAPTCHA integration, check our migration guide for easy instructions. This is a server-side SDK, which you would use to verify captcha solution against Private Captcha API. This SDK does not solve puzzles on the client side (used to protect APIs).\nGitHub repository Packagist package Installation composer require private-captcha/private-captcha-php Usage Always check our security recommendations when using this integration. Note\nBefore using this SDK, you’ll need an API key. If you don’t have one yet, see how to create an API key in the Getting Started guide.\nQuick start \u003c?php use PrivateCaptcha\\Client; // Initialize the client with your API key $client = new Client(apiKey: \"your-api-key-here\"); // Verify a captcha solution try { $result = $client-\u003everify(solution: \"user-solution-from-frontend\"); if ($result-\u003eisOK()) { echo \"Captcha verified successfully!\"; } else { echo \"Verification failed: {$result}\"; } } catch (Exception $e) { echo \"Error: {$e-\u003egetMessage()}\"; } Web framework integration Laravel example \u003c?php use Illuminate\\Http\\Request; use PrivateCaptcha\\Client; use PrivateCaptcha\\Exceptions\\SolutionException; class FormController extends Controller { private Client $client; public function __construct() { $this-\u003eclient = new Client(apiKey: config('services.privatecaptcha.key')); } public function submit(Request $request) { try { // Verify captcha from form data $this-\u003eclient-\u003everifyRequest($request-\u003eall()); // Process your form data here return response('Form submitted successfully!'); } catch (SolutionException $e) { return response('Captcha verification failed', 400); } } } Symfony example \u003c?php use Symfony\\Component\\HttpFoundation\\Request; use Symfony\\Component\\HttpFoundation\\Response; use PrivateCaptcha\\Client; use PrivateCaptcha\\Exceptions\\SolutionException; class FormController { private Client $client; public function __construct() { $this-\u003eclient = new Client(apiKey: $_ENV['PRIVATECAPTCHA_API_KEY']); } public function submit(Request $request): Response { try { $this-\u003eclient-\u003everifyRequest($request-\u003erequest-\u003eall()); // Process form data return new Response('Success!'); } catch (SolutionException $e) { return new Response('Captcha failed', 400); } } } Configuration Client configuration allows to set default form field and domain (can be used for self-hosting or EU isolation).","client-options#Client options":"\u003c?php use PrivateCaptcha\\Client; $client = new Client( apiKey: \"your-api-key\", domain: Client::EU_DOMAIN, // replace domain for self-hosting or EU isolation formField: \"private-captcha-solution\", // custom form field name timeout: 10, // request timeout in seconds );","configuration#Configuration":"","installation#Installation":"","laravel-example#Laravel example":"","non-standard-backend-domains#Non-standard backend domains":"\u003c?php use PrivateCaptcha\\Client; // Use EU domain $euClient = new Client( apiKey: \"your-api-key\", domain: Client::EU_DOMAIN // api.eu.privatecaptcha.com ); // Or specify custom domain in case of self-hosting $customClient = new Client( apiKey: \"your-api-key\", domain: \"your-custom-domain.com\" );","quick-start#Quick start":"","requirements#Requirements":"PHP 8.1+ cURL extension JSON extension","retry-configuration#Retry configuration":"\u003c?php $result = $client-\u003everify( solution: \"user-solution\", maxBackoffSeconds: 15, // maximum wait between retries attempts: 3 // number of retry attempts );","symfony-example#Symfony example":"","usage#Usage":"","web-framework-integration#Web framework integration":""},"title":"PHP"},"/docs/integrations/python/":{"data":{"":"To use this integration you need to create an API key in your account. If you have a working reCAPTCHA integration, check our migration guide for easy instructions. This is a server-side SDK, which you would use to verify captcha solution against Private Captcha API. This SDK does not solve puzzles on the client side (used to protect APIs).\nGitHub repository PyPi package Installation pip install private-captcha Usage Always check our security recommendations when using this integration. Note\nBefore using this SDK, you’ll need an API key. If you don’t have one yet, see how to create it in the Getting Started guide.\nQuick start from private_captcha import Client # Initialize the client with your API key client = Client(api_key=\"your-api-key-here\") # Verify a captcha solution try: result = client.verify(solution=\"user-solution-from-frontend\") if result.ok(): print(\"Captcha verified successfully!\") else: print(f\"Verification failed: {result}\") except Exception as e: print(f\"Error: {e}\") Web framework integration Flask example from flask import Flask, request from private_captcha import Client, SolutionError app = Flask(__name__) client = Client(api_key=\"your-api-key\") @app.route('/submit', methods=['POST']) def submit_form(): try: # Verify captcha from form data client.verify_request(request.form) # Process your form data here return \"Form submitted successfully!\" except SolutionError: return \"Captcha verification failed\", 400 Django example from django.http import HttpResponse from private_captcha import Client, SolutionError client = Client(api_key=\"your-api-key\") def submit_view(request): if request.method == 'POST': try: client.verify_request(request.POST) # Process form data return HttpResponse(\"Success!\") except SolutionError: return HttpResponse(\"Captcha failed\", status=400) Configuration","client-options#Client options":"from private_captcha import Client, EU_DOMAIN client = Client( api_key=\"your-api-key\", domain=EU_DOMAIN, # replace domain for self-hosting or EU isolation form_field=\"private-captcha-solution\", # custom form field name timeout=10.0, # request timeout in seconds )","configuration#Configuration":"","django-example#Django example":"","flask-example#Flask example":"","installation#Installation":"","non-standard-backend-domains#Non-standard backend domains":"For EU isolation, you can use built-in constant EU_DOMAIN:\nfrom private_captcha import Client, EU_DOMAIN # Use EU domain eu_client = Client( api_key=\"your-api-key\", domain=EU_DOMAIN # api.eu.privatecaptcha.com ) # Or specify custom domain in case of self-hosting custom_client = Client( api_key=\"your-api-key\", domain=\"your-custom-domain.com\" )","quick-start#Quick start":"","retry-configuration#Retry configuration":"When verifying puzzle solutions, you can also specify some retry and backoff options.\nresult = client.verify( max_backoff_seconds=15, # maximum wait between retries attempts=3 # number of retry attempts )","usage#Usage":"","web-framework-integration#Web framework integration":""},"title":"Python"},"/docs/integrations/react/":{"data":{"":"To use this integration you need to create a property in your organization and get it’s sitekey. Note\nYou can use a “default way” of adding element with https://cdn.privatecaptcha.com/widget/js/privatecaptcha.js Javascript include. But it will not work well with server-side rendering (e.g. in Next.js).\nThis is a client-side SDK for React, which is an alternative to using a standard script directly.\nGitHub repository NPM package","basic-usage#Basic usage":"import React from 'react'; import { PrivateCaptcha } from '@private-captcha/private-captcha-react'; function MyForm() { const handleCaptchaFinished = (detail) =\u003e { console.log('Captcha solved!', detail.widget.solution()); // Submit your form here or enable the submit button }; return ( \u003cform\u003e \u003cinput type=\"text\" name=\"username\" placeholder=\"Username\" /\u003e \u003cinput type=\"password\" name=\"password\" placeholder=\"Password\" /\u003e \u003cPrivateCaptcha siteKey=\"your-site-key-here\" theme=\"dark\" onFinish={handleCaptchaFinished} /\u003e \u003cbutton type=\"submit\"\u003eLogin\u003c/button\u003e \u003c/form\u003e ); }","eu-isolation#EU-isolation":"For EU isolation you need to add eu=\"true\" attribute to the widget declaration:\n\u003cPrivateCaptcha siteKey=\"your-site-key\" eu={true} /\u003e","event-handler-props#Event handler props":"All event handler functions receive a detail object with these properties:\ndetail.widget - captcha object detail.element - The DOM element hosting the captcha Prop Type Description onInit (detail) =\u003e void Called when captcha is initialized onStart (detail) =\u003e void Called when solving starts onFinish (detail) =\u003e void Called when solving completes onError (detail) =\u003e void Called when an error occurs","examples#Examples":"","installation#Installation":"npm install @private-captcha/private-captcha-react","optional-props#Optional props":"Please refer to the official widget options documentation.","props-api#Props API":"","required-props#Required props":"Prop Type Description siteKey string Your Private Captcha site key","requirements#Requirements":"React 18+"},"title":"React"},"/docs/integrations/ruby/":{"data":{"":"To use this integration you need to create an API key in your account. If you have a working reCAPTCHA integration, check our migration guide for easy instructions. This is a server-side SDK, which you would use to verify captcha solution against Private Captcha API. This SDK does not solve puzzles on the client side (used to protect APIs).\nGitHub repository RubyGems package","client-options#Client options":"require 'private_captcha' client = PrivateCaptcha::Client.new do |config| config.api_key = 'your-api-key' config.domain = PrivateCaptcha::Configuration::EU_DOMAIN # replace domain for self-hosting or EU isolation config.form_field = 'private-captcha-solution' # custom form field name config.max_backoff_seconds = 20 # maximum wait between retries config.attempts = 5 # number of retry attempts config.logger = Logger.new(STDOUT) # optional logger end","configuration#Configuration":"","installation#Installation":"Add this line to your application’s Gemfile:\ngem 'private_captcha' And then execute:\nbundle install Or install it yourself as:\ngem install private_captcha","non-standard-backend-domains#Non-standard backend domains":"require 'private_captcha' # Use EU domain eu_client = PrivateCaptcha::Client.new do |config| config.api_key = 'your-api-key' config.domain = PrivateCaptcha::Configuration::EU_DOMAIN # api.eu.privatecaptcha.com end # Or specify custom domain in case of self-hosting custom_client = PrivateCaptcha::Client.new do |config| config.api_key = 'your-api-key' config.domain = 'your-custom-domain.com' end","quick-start#Quick start":"require 'private_captcha' # Initialize the client with your API key client = PrivateCaptcha::Client.new do |config| config.api_key = 'your-api-key-here' end # Verify a captcha solution begin result = client.verify('user-solution-from-frontend') if result.ok? puts 'Captcha verified successfully!' else puts \"Verification failed: #{result.error_message}\" end rescue PrivateCaptcha::Error =\u003e e puts \"Error: #{e.message}\" end","rack-middleware#Rack middleware":"require 'private_captcha' use PrivateCaptcha::Middleware, api_key: 'your-api-key', failed_status_code: 403","rails-example#Rails example":"class FormsController \u003c ApplicationController def submit client = PrivateCaptcha::Client.new do |config| config.api_key = 'your-api-key' end begin client.verify_request(request) # Process form data render plain: 'Success!' rescue PrivateCaptcha::Error render plain: 'Captcha failed', status: :bad_request end end end","retry-configuration#Retry configuration":"result = client.verify( 'solution', max_backoff_seconds: 15, # maximum wait between retries attempts: 3 # number of retry attempts )","sinatra-example#Sinatra example":"require 'sinatra' require 'private_captcha' client = PrivateCaptcha::Client.new do |config| config.api_key = 'your-api-key' end post '/submit' do begin # Verify captcha from form data client.verify_request(request) # Process your form data here 'Form submitted successfully!' rescue PrivateCaptcha::Error status 400 'Captcha verification failed' end end","usage#Usage":"Always check our security recommendations when using this integration. Note\nBefore using this SDK, you’ll need an API key. If you don’t have one yet, see how to create an API key in the Getting Started guide.","web-framework-integration#Web framework integration":""},"title":"Ruby"},"/docs/integrations/wordpress/":{"data":{"":"This is a all-in-one plugin for WordPress that allows you to configure client-side captcha widget and server-side verification.\nWordPress plugin GitHub repository","configure-sitekey-and-api-key#Configure Sitekey and API key":"Using values, that you created previously in the Private Captcha portal, configure the plugin:\nNotably, put created API key into a required field “API Key” and property sitekey into a required field “Site Key”.\nClick “Save Changes” button below and your configuration will be verified.","create-a-new-api-key#Create a new API key":"Go to API key settings and click “Create new key”. Give it some meaningful name, like “WordPress API key” and select the scope Captcha verification.\nMake sure to select scope 'Captcha verification' Copy API key value to your password manager to temporarily save it (note the expiration time you selected when creating above).","create-a-new-property-in-private-captcha-portal#Create a new property in Private Captcha portal":"Go to Private Captcha Portal and click “Add new property” button.\nEnter name and domain of your WordPress website e.g. mydomain.com and “My WordPress website”.\nWarning\nDomain of the property should exactly match your WordPress website domain.","features#Features":"Form Protection: Login, registration, password reset, and comment forms Flexible Configuration: Theme, language, start mode, and custom styling options EU Compliance: Support for EU-only endpoints and custom domains WP-CLI Commands: Emergency management tools for API key updates and login bypass","install-private-captcha-plugin-in-wordpress#Install Private Captcha plugin in WordPress":"Click one of the two “Add plugin” buttons in your WordPress installation, search for Private Captcha and install the plugin:\nAfter the installation, Activate the plugin:","note-sitekey-of-the-property#Note Sitekey of the property":"Open “Integrations” tab and note the Sitekey of the property you just created. You will need it for WordPress plugin configuration.","requirements#Requirements":"WordPress 5.6+ PHP 8.2+ Private Captcha account","step-by-step-setup-guide#Step-by-step setup guide":"","supported-forms#Supported Forms":"WordPress Login Form WordPress Registration Form WordPress Password Reset Form WordPress Comment Forms (logged-in and guest users) WPForms Contact Form 7 (use [privatecaptcha] tag) More forms support (including popular plugins) are currently in progress","test-integration#Test integration":"Just for test, enable login form integration.\nNow, open login dialog for your WordPress installation (e.g. in Private browser tab):","troubleshooting#Troubleshooting":"Warning\nMake sure to exclude Private Captcha script from any caching plugins you might be using like “WP Super Cache”, “W3 Total Cache”, or “WP Rocket”. Only load script from cdn.privatecaptcha.com.\nForm integration is enabled, but captcha does not load.\nPossible reasons:\nDomain name of your WordPress site does not equal exactly to the domain name of the property in Private Captcha portal If you are testing locally, you need to enable “Allow localhost” in Property settings","wp-cli-commands#WP-CLI Commands":"Emergency management when locked out:\n# Update API key wp private-captcha update-api-key \"your-new-api-key\" # Disable login captcha (emergency use) wp private-captcha disable-login"},"title":"WordPress"},"/docs/reference/":{"data":{"":"Reference of API and parameters that you can use.\nNote\nAPI is also available here as Swagger / OpenAPI definition.\nWidget options Verify API Captcha JS object Property settings Testing EU isolation Security Platform API DNS proxy"},"title":"Reference"},"/docs/reference/captcha-object/":{"data":{"":"Captcha object is available as the window.privateCaptcha.autoWidget or as attached via data-store-variable attribute. It is also passed as the only parameter into all of the callbacks.","execute#\u003ccode\u003eexecute()\u003c/code\u003e":"Starts solving captcha puzzle, shows widget if needed (e.g. for display style popup). Can be used instead of default handler for forms (make sure not to use input type submit for the button).\nExample:\n\u003cform\u003e \u003cbutton type=\"button\" onclick=\"window.privateCaptcha.autoWidget.execute()\"\u003eSubmit\u003c/button\u003e \u003c/form\u003e","methods#Methods":"","reset#\u003ccode\u003ereset()\u003c/code\u003e":"Resets capcha widget to the initial state. Deletes found solution. Optionally can accept an object with options, that correspond to the data-attributes, that are set on the widget itself. Please mind the name conversion rules for dataset attributes. For popup display mode, reset() will hide the widget.\nExample:\nwindow.privateCaptcha.autoWidget.reset(); // with options window.privateCaptcha.autoWidget.reset({debug: true, displayMode: 'popup'});","solution#\u003ccode\u003esolution()\u003c/code\u003e":"Returns the found solution. Can be used in callbacks for custom processing of the form.\nExample:\nfunction onCaptchaSolved(widget) { console.log('Found solution:', widget.solution()); } \u003cdiv class=\"private-captcha\" data-sitekey=\"xyz\" data-finished-callback=\"onCaptchaSolved\"\u003e\u003c/div\u003e"},"title":"Captcha object"},"/docs/reference/dns-proxy/":{"data":{"":"It is possible to make captcha widget to fetch puzzles and, later, verify solutions against your domain or subdomain instead of api.privatecaptcha.com by using a “CNAME proxy”.","add-a-new-dns-record#Add a new DNS record":"With your DNS provider, setup a CNAME record for the chosen domain/subdomain to point to api.privatecaptcha.com (also possible to choose EU isolation endpoint api.eu.privatecaptcha.com).\nExample with CloudFlare:\nIn CloudFlare use 'DNS only' record type","basic-idea#Basic idea":"For loading captcha widget, end-user never contacts *.privatecaptcha.com domains.\nsequenceDiagram participant User as End User participant Web as Customer Website participant CNAME as captcha.customer.com(CNAME Record) participant API as api.privatecaptcha.com Note over User,API: Captcha Display Flow User-\u003e\u003eWeb: Visit website Web-\u003e\u003eCNAME: Load captcha widget Note over CNAME: DNS resolves toapi.privatecaptcha.com CNAME-\u003e\u003eAPI: Request forwarded API--\u003e\u003eUser: Captcha displayed(appears from customer.com) Note over User,API: ✓ User only sees customer.com domain You can also verify puzzle solutions against the same configured domain, but, on the backend, this has little value.","setup-dns-proxy-in-portal#Setup DNS proxy in Portal":"Note\n“DNS Proxy” functionality requires to have an add-on purchased via the Billing settings.\nGo to the Private Captcha Portal and navigate to Settings -\u003e DNS Proxy. Enter you domain and select the same endpoint (Global/EU) that you added in the previous step with your DNS provider.\nEnter your domain and select Global/EU endpoint","step-by-step-setup#Step-by-step setup":"","testing#Testing":"Note\nDNS changes (on both sides!) can take up to 24 hours to propagate.\nYou test this locally using a test puzzle:\ncurl -H \"Origin: not-empty\" https://yourdomain.com/puzzle\\?sitekey\\=aaaaaaaabbbbccccddddeeeeeeeeeeee when this works, you can try opening the webpage where you have the widget.","update-widget-snippet#Update widget snippet":"The last step is to update the widget to fetch puzzles via your domain. To achieve that you need to set data-puzzle-endpoint attribute.\nindex.html@@ -32,7 +32,7 @@"},"title":"DNS Proxy"},"/docs/reference/eu-isolation/":{"data":{"":"There’s a way to use Private Captcha APIs in such a way that all requests are routed exclusively to our servers in EU locations.\nNote\nPrivate Captcha uses EU-only suppliers so by “servers in EU locations” we don’t mean a US-based company (e.g. AWS) with EU points of presence.\nTo achieve this you need to make 2 changes: one on the frontend and second on the backend.\nTL;DR; version is that you need to replace in your code api.privatecaptcha.com to api.eu.privatecaptcha.com and set data-eu=\"true\" in widget.","backend-changes#Backend changes":"","frontend-changes#Frontend changes":"To make sure captcha widget only talks to EU APIs you need to set a data-eu to true in the widget declaration:\nDiffFull code","implications#Implications":"The cost of EU isolation is the potential slowdown of the initial widget initialization, in case the end-user is accessing website geographically far from Europe. In most cases it should not be noticeable to the end-user as most operations happen strictly in the background.","recaptcha-compatible-api#reCAPTCHA-compatible API":"When you verify the form submission on the server side, you need to make POST request to the corresponding EU endpoint: https://api.eu.privatecaptcha.com/siteverify.\ncurl -X POST \\ -H \"X-Api-Key: your-api-key-here\" \\ -d \"solution\" \\ - https://api.privatecaptcha.com/siteverify + https://api.eu.privatecaptcha.com/siteverify","sdks#SDKs":"When you’re using one of the integration SDKs you need to specify EU isolation during configuration.\nHere’s an example for Go:\nDiffFull code client, err := privatecaptcha.NewClient(privatecaptcha.Configuration{ APIKey: \"pc_abcdef\", + Domain: privatecaptcha.EUDomain, }) client, err := privatecaptcha.NewClient(privatecaptcha.Configuration{ APIKey: \"pc_abcdef\", Domain: privatecaptcha.EUDomain, })"},"title":"EU Isolation"},"/docs/reference/platform-api/":{"data":{"":"Note\nAPI is also available here as Swagger / OpenAPI definition.\nThis reference documentation describes the Portal API for Private Captcha, which allows for the management of organizations, properties, and asynchronous tasks.\nIf you are looking for an API to verify captcha challenges, see Verify API.","async-tasks#Async Tasks":"","authentication#Authentication":"All endpoints in this section require an API key with the “Portal operations” scope. This key must be sent in the X-API-Key header.\nExample Header:\nX-API-Key: your-portal-api-key","create-organization#Create Organization":"Creates a new organization for the user. Note that the id field in the input must be empty.\nMethod: POST Endpoint: /org Input: JSON object with name (string). Output: Object containing id (string) and name (string). RequestResponse curl -X POST https://api.privatecaptcha.com/org \\ -H \"X-API-Key: your-portal-api-key\" \\ -H \"Content-Type: application/json\" \\ -d '{\"name\": \"New Marketing Org\"}' { \"meta\": { \"code\": 1000, \"description\": \"OK\", \"request_id\": \"req_12345\" }, \"data\": { \"id\": \"vDWtASYqrB\", \"name\": \"New Marketing Org\" } }","create-properties-async#Create Properties (Async)":"Triggers an asynchronous task to create a batch of properties (up to 128). It returns a task ID that can be used to check the status.\nMethod: POST Endpoint: /org/{org_id}/properties Input: Array of objects containing name, domain, and optional settings (level, growth, validity_seconds, allow_subdomains, allow_localhost, max_replay_count). Output: Object containing task id. RequestResponse curl -X POST https://api.privatecaptcha.com/org/vDWtASYqrB/properties \\ -H \"X-API-Key: your-portal-api-key\" \\ -H \"Content-Type: application/json\" \\ -d '[{\"name\": \"Blog\", \"domain\": \"blog.example.com\"}]' { \"meta\": { \"code\": 1000, \"description\": \"OK\", \"request_id\": \"qwerty123\" }, \"data\": { \"id\": \"e3e6854e06944cf48f49f93abb5a527e\" } }","delete-organization#Delete Organization":"Deletes an existing organization. Only the owner can perform this action.\nMethod: DELETE Endpoint: /org Input: JSON object with the id (string) of the organization to delete. Output: null. RequestResponse curl -X DELETE https://api.privatecaptcha.com/org \\ -H \"X-API-Key: your-portal-api-key\" \\ -H \"Content-Type: application/json\" \\ -d '{\"id\": \"vDWtASYqrB\"}' { \"meta\": { \"code\": 1000, \"description\": \"OK\", \"request_id\": \"req_12345\" } }","delete-properties-async#Delete Properties (Async)":"Triggers an asynchronous task to delete a batch of properties.\nMethod: DELETE Endpoint: /properties Input: Array of strings (encrypted property IDs). Output: Object containing task id. RequestResponse curl -X DELETE https://api.privatecaptcha.com/properties \\ -H \"X-API-Key: your-portal-api-key\" \\ -H \"Content-Type: application/json\" \\ -d '[\"0VgGggmbGa\"]' { \"meta\": { \"code\": 1000, \"description\": \"OK\" }, \"data\": { \"id\": \"e3e6854e06944cf48f49f93abb5a527e\" } }","get-org-properties#Get Org Properties":"Lists properties associated with a specific organization. This endpoint supports pagination.\nMethod: GET Endpoint: /org/{org_id}/properties Query Parameters: page: Page number (optional) per_page: Items per page (optional, max 50) Output: Array of objects containing id, name, and sitekey. RequestResponse curl -X GET \"https://api.privatecaptcha.com/org/vDWtASYqrB/properties?page=1\u0026per_page=10\" \\ -H \"X-API-Key: your-portal-api-key\" { \"meta\": { \"code\": 1000, \"description\": \"OK\", \"request_id\": \"qwerty123\" }, \"data\": { \"properties\": [ { \"id\": \"0VgGggmbGa\", \"name\": \"Primary Domain\", \"sitekey\": \"525e0ef5b9bc489f882274b3ca24b710\" }, ... ], \"pagination\": { \"page\": 1, \"per_page\": 10, \"has_more\": false } } }","get-property-details#Get Property details":"Retrieves detailed settings for a specific property.\nMethod: GET Endpoint: /org/{org_id}/property/{property_id} Output: Object containing property details (id, name, domain, sitekey, level, growth, validity_seconds, allow_subdomains, allow_localhost, max_replay_count). RequestResponse curl -X GET https://api.privatecaptcha.com/org/vDWtASYqrB/property/0VgGggmbGa \\ -H \"X-API-Key: your-portal-api-key\" { \"meta\": { \"code\": 1000, \"description\": \"OK\", \"request_id\": \"qwerty123\" }, \"data\": { \"id\": \"0VgGggmbGa\", \"name\": \"Primary Domain\", \"domain\": \"example.com\", \"sitekey\": \"525e0ef5b9bc489f882274b3ca24b710\", \"level\": 1, \"growth\": \"medium\", \"validity_seconds\": 21600, \"allow_subdomains\": false, \"allow_localhost\": false, \"max_replay_count\": 1 } } See also Property Settings for details on each specific field. Field Type Description id string Unique identifier of the property. name string Display name of the property. domain string The domain name where the widget is deployed. sitekey string The public key used to integrate the widget. level integer Difficulty level of the puzzle. Must be between 1 and 255. growth string Difficulty growth rate. Allowed values: constant, slow, medium, fast. validity_seconds integer Duration in seconds for which a single solution remains valid. allow_subdomains boolean If true, the widget will work on subdomains of the specified domain. allow_localhost boolean If true, the widget will work on localhost and 127.0.0.1. max_replay_count integer Maximum number of times a single solution can be verified during the validity_seconds. Must be between 1 and 1,000,000.","get-task-details#Get Task details":"Retrieves the current status and results of an asynchronous task.\nMethod: GET Endpoint: /asynctask/{id} Output: Object containing id, finished (bool), and result (one or many of operation results). RequestResponse curl -X GET https://api.privatecaptcha.com/asynctask/e3e6854e06944cf48f49f93abb5a527e \\ -H \"X-API-Key: your-portal-api-key\" { \"meta\": { \"code\": 1000, \"description\": \"OK\", \"request_id\": \"qwerty123\" }, \"data\": { \"id\": \"e3e6854e06944cf48f49f93abb5a527e\", \"finished\": true, \"result\": [ { \"code\": 1000 }, ... ] } }","get-user-organizations#Get User Organizations":"Retrieves a list of all organizations owned by the authenticated user.\nMethod: GET Endpoint: /orgs Output: Array of objects containing id (string) and name (string). RequestResponse curl -X GET https://api.privatecaptcha.com/orgs \\ -H \"X-API-Key: your-portal-api-key\" { \"meta\": { \"code\": 1000, \"description\": \"OK\", \"request_id\": \"req_12345\" }, \"data\": [ { \"id\": \"vDWtASYqrB\", \"name\": \"Company Website\" }, ... ] }","organizations#Organizations":"","properties#Properties":"","response-structure#Response structure":"All API responses follow a standard JSON structure containing meta, data, and optional pagination objects.\n{ \"meta\": { \"code\": 1000, \"description\": \"OK\", \"request_id\": \"req_12345\" }, \"data\": { ... }, \"pagination\": { \"page\": 0, \"per_page\": 50, \"has_more\": true } } Field Required Explanation meta yes Contains the status code, a human-readable description, and a unique request_id. data yes The payload of the response (object or array). pagination no (Optional) Present on list endpoints.","status-codes#Status codes":"Common status codes:\nCode Description 1000 OK 1001 Failure 1002 Undefined 1003 Not implemented 1004 API is deprecated Organization management status codes:\nCode Description 1100 Name cannot be empty. 1101 Name is too long. 1102 Organization name contains invalid characters. 1103 Organization with this name already exists. 1104 Organizations limit reached on your current plan, please upgrade to create more. 1105 Requested organization does not seem to exist. 1106 You do not have permissions to access this organization. 1107 Organization ID must be empty. 1108 Organization ID must not be empty. 1109 Organization ID is not valid. Property management status codes:\nCode Description 1200 Properties batch limit size was exceeded. 1201 Name cannot be empty. 1202 Name is too long. 1203 Property name contains invalid characters. 1204 Property with this name already exists. 1205 Domain name cannot be empty. 1206 Localhost is not allowed as a domain. 1207 IP address cannot be used as a domain. 1208 Domain name is not valid. 1209 Failed to resolve domain name. 1210 Invalid format of domain name. 1211 Property ID cannot be empty. 1212 Property ID is not valid. 1213 Duplicate property ID found in request. 1214 Insufficient permissions to update settings. Subscription status codes:\nCode Description 1300 Property limit reached for current subscription plan.","update-organization#Update Organization":"Updates an existing organization. Only the owner can perform this action.\nMethod: PUT Endpoint: /org Input: JSON object with id (string) and name (string). Output: Object containing id (string) and name (string). RequestResponse curl -X PUT https://api.privatecaptcha.com/org \\ -H \"X-API-Key: your-portal-api-key\" \\ -H \"Content-Type: application/json\" \\ -d '{\"id\": \"vDWtASYqrB\", \"name\": \"Updated Name\"}' { \"meta\": { \"code\": 1000, \"description\": \"OK\", \"request_id\": \"req_12345\" }, \"data\": { \"id\": \"vDWtASYqrB\", \"name\": \"Updated Name\" } }","update-properties-async#Update Properties (Async)":"Triggers an asynchronous task to update a batch of properties.\nMethod: PUT Endpoint: /properties Input: Array of objects containing id and settings to update. Output: Object containing task id. RequestResponse curl -X PUT https://api.privatecaptcha.com/properties \\ -H \"X-API-Key: your-portal-api-key\" \\ -H \"Content-Type: application/json\" \\ -d '[{\"id\": \"0VgGggmbGa\", \"level\": 2}]' { \"meta\": { \"code\": 1000, \"description\": \"OK\", \"request_id\": \"qwerty123\" }, \"data\": { \"id\": \"e3e6854e06944cf48f49f93abb5a527e\" } }"},"title":"Platform API"},"/docs/reference/property-settings/":{"data":{"":"Protection of a website or a form starts with creating a property in the Portal . Property corresponds to a single CAPTCHA widget - it can be used on a website, a particular web page, form, subdomain etc. Property is identified by a Site Key, which looks like aaaaaaaabbbbccccddddeeeeeeeeeeee. Site Key is used in the widget initialization.\nWe’ll go through all property settings that you can change.","base-difficulty#Base difficulty":"This is the “default” challenge difficulty level when there are no user requests at all. You can test how does it feel using the playground right below those settings.","challenge-difficulty#Challenge difficulty":"Each CAPTCHA challenge has a certain “difficulty”. Difficulty corresponds to the amount of resource the client has to use in order to “solve” the challenge. The higher the difficulty, more resources are required to “solve” (pass) the challenge.\nPrivate Captcha offers dynamic (automatically scaled) difficulty out of the box in all plans. This means when there are more requests, the difficulty of each subsequent challenge will grow, and when there are less requests, it will fall back to base settings. This is the basis of the security of scale.","challenge-verification#Challenge verification":"There’re 2 important settings in this section:","difficulty-growth#Difficulty growth":"When user (or bots) requests to your resources (websites, forms, API) keep coming, Private Captcha automatically scales the difficulty. You have 3 options of how fast the difficulty changes based on the number of requests:\nConstant (difficulty does not change at all and the value you set will always be returned) Slow (difficulty changes slower than usual, it will take more requests to increase the difficulty on average) Normal (default setting of difficulty growth) Fast (difficulty growth is very reactive and will grow faster as more requests come)","domain#Domain":"You set domain when you create the property in the Portal. You can change the property name, but you cannot change Domain in settings.","localhost#Localhost":"In the lieu of the “Subdomains” logic, localhost access (for development) is also not allowed by default (in that case anybody can use your property Site Key locally). But you can temporarily enable “Allow localhost” for development purposes. In that case you will have a “testing” label added to your property.","repeated-solutions#Repeated solutions":"Note\nThis is an advanced setting that allows to build different applications out of Private Captcha API.\nBy default you cannot submit a solution to the same CAPTCHA puzzle more than once. Second time it will be considered invalid. This is a protection against so called “replay attack”, where a malicious actor solves puzzle only once, but sends your form or accesses your page multiple times.\nHowever, there are cases when you want to allow this. One example if when Private Captcha is used as a proxy in front of your website, like in the use-case of AI scrapers protection (or API endpoints protection). In such case when the user requests a webpage with a valid solution (solved challenge/puzzle), we want to grant them access, up to a certain number of times.\nThis is where the setting with the number of repeated solutions comes into play. If you set the value to, say, 5, it means user can solve the CAPTCHA puzzle once to access your resources 5 times before being requested to pass another challenge. The exact number you want to use is the trade off between annoying your user base and protecting your resources against automated access or AI scrapers.","subdomains#Subdomains":"By default CAPTCHA requests are only allowed on the domain that you used to create the property. If you created property with domain example.com, then you cannot use the same widget on portal.example.com. However, if you enable “Allow subdomains” checkbox, all subdomains are allowed.","verification-window#Verification window":"Captcha challenges (or “puzzles”) have a validity period during which they can be “solved” and verified. You can set validity period from few minutes to a couple of days. If a CAPTCHA solution is checked outside of validity period, it’s considered invalid."},"title":"Property settings"},"/docs/reference/security/":{"data":{"":"","api-key-rotation#API key rotation":"Each API key that you use for the server-side validation, has an expiration date and will either expire or will have to be rotated. You should receive an email notification before your API key is expired.","client-libraries#Client libraries":"Make sure to automatically update your client library version for Private Captcha (e.g. using Renovate or Dependabot). Safe option is to have a “stability days” buffer (e.g. 7 days) before automatically merging updates.","client-side#Client side":"","content-security-policy-settings#Content-Security-Policy Settings":"If you use Content Security Policy (CSP) headers, you need to add few domains to your configuration (also applies if you use EU Isolation).\nYou need to add https://privatecaptcha.com, https://*.privatecaptcha.com to script-src, frame-src, style-src, connect-src.\nDo not hard-code specific subdomains, like api.privatecaptcha.com, into your CSP.","localhost-access#Localhost access":"Make sure that “Allow localhost” is not enabled in Property settings for the “production” sitekey. It is acceptable only for the development version of the property (which you should use).","server-side#Server side":"","sitekey-rotation#Sitekey rotation":"Usually you do not need to rotate the client widget sitekey.","verification#Verification":"All server-side integrations have some kind of a Verify(solution) method that returns an object that has a method OK(). This is the only method you should be checking to see if CAPTCHA solution is valid. If the result is false, you can get more details by checking underlying fields Success and Code (for debugging purposes only).\nAll server-side integrations allow you to specify an optional sitekey parameter with each verification request. This is the sitekey that you are expected to check the solution against and, while being optional, is recommended to make use of.\nWhat is the point of the sitekey argument It is an additional layer of verification. For example, if you’re using verification API incorrectly, an attacker can send you a solution for test puzzle. Verification will return Success field set to true (by design) and Code (error) set as test-property. If you would set the expected sitekey, it will eliminate this kind of errors.\nNOTE: this kind of errors is already eliminated if you’re using OK() methods and not checking success/code yourself","widget-display-mode#Widget display mode":"Usual widget type (data-display-mode=\"widget\") is the safest option.\nEqually secure is using a popup widget IF it has data-start-mode=\"click\", thus forcing user to click the widget in the popup. Using popup widget with auto start mode (the default) is not the most secure option and is not recommended.\nWhen you hide the widget using data-display-mode=\"hidden\", security of the CAPTCHA protection depends entirely on your implementation. For example, if you start solving captcha automatically (instead of somehow forcing user to click on something), it is relatively similar for bots to having no captcha at all (sans the resource cost of proof-of-work).","widget-script-cdn#Widget script (CDN)":"Make sure that you are not serving the Private Captcha widget yourself (especially relevant for various WordPress caching plugins) and your website is always loading widget from cdn.privatecaptcha.com."},"title":"Security"},"/docs/reference/testing/":{"data":{"":"There’re 2 main ways how you can keep using Private Captcha for testing of your local website:\nuse a predefined (“dummy”) sitekey allow localhost access for main property in Settings in portal","client-side#Client side":"This is a sample captcha widget for testing:\n\u003cdiv class=\"private-captcha\" data-sitekey=\"aaaaaaaabbbbccccddddeeeeeeeeeeee\"\u003e \u003c/div\u003e Note\nWidget will show red \"testing\" text to highlight that it’s not for production use once you click it.","server-side#Server side":"On the server side, once you are using Verify API, all responses will contain { \"success\": true } (“verification passed”) and { \"error-codes\": [\"property-test\"] } (non-empty error codes). Of course, you should be mainly checking success field and error-codes semantics is just to distinguish actual errors.\nSending verify request This is a sample payload for test property, that should always return “success” (please note this is for illustration purposes only as payload can change)\ncurl \\ -X POST \\ -H \"X-Api-Key: your-api-key\" \\ -d \"AQIAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA.Aaqqqqq7u8zM3d3u7u7u7u4AAAAAAAAAAAAQAAAAAAAAAAAAAAAAAAAAAAAAAAA=.AQCBnM2czBK6rlq+l06lXBtIDQH/PFk=\" \\ https://api.privatecaptcha.com/verify And if everything is set up correctly, the output will be\n{\"success\":true,\"code\":10,\"timestamp\":\"0001-01-01T00:00:00Z\",\"origin\":\"\"} Code 10 corresponds to \"property-test\" error description.","testing-with-localhost-access#Testing with localhost access":"Warning\nCaptcha has a strict CORS policy and, by default, it will load only on the domain configured during property creation. Subdomains and localhost access needs to be explicitly allowed.\nIn order to make captcha widget to load on localhost domain, we need to allow it in the settings of the property you just created.\nWorth noting that this is not required if you use the dummy sitekey.","testing-with-predefined-sitekey#Testing with predefined sitekey":"Recommended way to use Private Captcha for development is to use different sitekeys for production and testing. For testing you can use a “dummy” sitekey (aka “test property”): aaaaaaaabbbbccccddddeeeeeeeeeeee. This sitekey does not incur any actual solving “price” (in compute resources) on the frontend and the result always passes verification. Please note that captcha widget still has to be clicked to pass by default, unless you are using data-start-mode=\"auto\" (in which case parent form needs to gain focus)."},"title":"Testing"},"/docs/reference/verify-api/":{"data":{"":"Note\nThere’re many ready integrations available and API is also available here as Swagger / OpenAPI definition.\nAfter captcha widget has finished solving the puzzle, it adds a hidden form field with solution (defined by data-solution-field attribute).\n\u003cform\u003e \u003cinput name=\"private-captcha-solution\" type=\"hidden\" value=\"AAAAAAACAhQEAOiDAAAAAAC...IsoSTgYAAA=\"\u003e \u003c/form\u003e When handling form submission on the server-side, this is the field you need to validate using Private Captcha API.","error-codes#Error codes":"Note\nIf code is not zero, it does not mean that verification failed. See details below.\nDefault /verify endpoint should be used with one of the integration SDKs which allow you to get a string description of the numeric error code.\nreCAPTCHA-compatible /siteverify endpoint will contain the string version in error-codes field.\ncode can be one of the error codes:\nCode Error Description 0 no-error No error (shown here for completeness) 1 error-other Unspecified error 2 solution-duplicates Solution contains duplicates 3 solution-invalid Solution verification error 4 solution-bad-format Solution has invalid format 5 puzzle-expired Puzzle for this solution has expired 6 property-invalid Property for this puzzle/solution cannot be found 7 property-owner-mismatch API key’s owner does not have permission for property 8 solution-verified-before Solution has been already verified 9 maintenance-mode Maintenance mode (see below) 10 property-test Test property is used for verification 11 integrity-error Puzzle or solution integrity is compromised 12 org-scope-error Property belongs to a different org than API key scope","errors-during-successful-verification#Errors during successful verification":"There are a couple of cases, when success in response will be equal to true (successful verification), but code will not be zero. This is made in order to help you distinguish certain use-cases of captcha (and decide yourself if you trust submissions):\nWhen you’re using a test property, code will be property-test (but verification will succeed). During maintenance mode, Private Captcha still verifies cryptographic solution validity, however, account validity might not be possible to verify. If solution is valid, success in response is equal to true, but code will be maintenance-mode. If you configured property to “Accept repeated solutions” (during verification window), verification of repeated solution will cause code to be solution-verified-before.","request#Request":"All endpoints in this section require an API key with the “Captcha verification” scope. This key must be sent in the X-API-Key header. To verify solutions you need to make a POST request to https://api.privatecaptcha.com/verify with the body of the request being solution field’s contents from your form.\n# an example how that will look like with curl curl -X POST \\ -H \"X-Api-Key: your-api-key-here\" \\ -d \"solution\" \\ https://api.privatecaptcha.com/verify Note\nUsually you would not send that POST request yourself, but use one of our pre-built integrations.","response#Response":"Here’s how a successful response from /verify endpoint looks like:\n{ \"success\": true, \"timestamp\": \"2025-01-13T16:17:27+00:00\", \"origin\": \"privatecaptcha.com\", \"code\": 0 }","verifying-captcha#Verifying captcha":"Verification status is defined by 2 fields: success (boolean) must be equal to true and code (integer) must be 0."},"title":"Verify API"},"/docs/reference/widget-options/":{"data":{"":"Here’s the minimal captcha field declaration:\nindex.html\u003cdiv class=\"private-captcha\" data-sitekey=\"abcdef\"\u003e\u003c/div\u003e Private Captcha widget is automatically initialized on all elements with private-captcha class name.","attributes#Attributes":"Apart from the required sitekey data attribute, the following optional attributes are supported:\nAttribute Values Description data-start-mode auto, click In auto mode (default) captcha widget starts solving captcha whenever parent form receives focus. data-debug true When set to true, will show widget’s internal state and print debug logs. data-solution-field private-captcha-solution, your value Name of the hidden form field with captcha solution that has to be verified on the server side. data-eu true When set to true, will make widget to use only EU endpoints for EU-isolation. data-puzzle-endpoint '' or your value Endpoint to get captcha puzzle (override in case of self-hosting). data-display-mode widget, popup, hidden How captcha widget will be shown. Defaults to widget. When hidden, you need to setup widget callbacks (see below). data-lang en Captcha widget localization (defaults to auto) data-theme light, dark Widget theme (defaults to light) data-styles {valid CSS} Overrides for host variables of the widget’s web component, on top of theme. data-store-variable {JS variable name} If present, attaches Captcha Object to the html element (helps with multiple widgets on a page)","data-display-mode#\u003ccode\u003edata-display-mode\u003c/code\u003e":"widget is the default display mode of captcha\npopup captcha widget appears relative to the first parent that has a class private-captcha-anchor.\nNOTE: popup style is recommended to use with data-start-mode=\"click\" for security purposes\n\u003cform\u003e \u003cdiv class=\"private-captcha-anchor\"\u003e \u003cdiv class=\"private-captcha\" data-sitekey=\"xyz\" data-display-mode=\"popup\" data-start-mode=\"click\"\u003e\u003c/div\u003e \u003c/div\u003e \u003cbutton type=\"button\" onclick=\"window.privateCaptcha.autoWidget.execute()\"\u003eClick me!\u003c/button\u003e \u003c/form\u003e Click me! hidden captcha widget is permanently hidden and you need to handle all callbacks yourself. See example.","data-lang#\u003ccode\u003edata-lang\u003c/code\u003e":"data-lang allows you to show widget localization in your own language. Translations are defined in the widget/js/strings.js file . If translation to your language is not there, feel free to contribute it.\nNOTE: by default data-lang attribute’s value is auto which will attempt to get the current page language and fallback to English. If you want widget to have a static language, add this attribute.\nHere’s the list of currently supported languages:\nEnglish (en) Deutsch (de) Español (es) Français (fr) Italiano (it) Nederlands (nl) Svenska (sv) Norsk (no) Polski (pl) Suomi (fi) Eesti (et) Here’s how to localize a widget:\nindex.html@@ -32,7 +32,7 @@","data-store-variable#\u003ccode\u003edata-store-variable\u003c/code\u003e":"Captcha object, that is created from the widget configuration, provides a number of APIs.\nIf this is the only captcha widget on a page, you can access this object via window.privateCaptcha.autoWidget.\nHowever, in case of multiple widgets, you can assign this attribute to a variable name and then access it as a field of the HTMLElement.\n\u003cdiv class=\"private-captcha\" data-sitekey=\"xyz\" id=\"pcWidget\" data-store-variable=\"_privateCaptcha\"\u003e\u003c/div\u003e \u003cbutton type=\"button\" onclick=\"document.getElementById('pcWidget')._privateCaptcha.execute()\"\u003e Submit \u003c/button\u003e","data-styles#\u003ccode\u003edata-styles\u003c/code\u003e":"Check out a collection of examples of widget customization using this attribute. data-styles allows you to override some of the widget styles to better fit into your website’s design, on top of data-theme. Example of override: data-style=\"--border-radius: .75rem;\".\nThe following variables support overrides (but in general are not encouraged to change).\nColors:\n--dark-color --gray-color --pie-color --background-color --checkbox-background-color --checkbox-hover-color --accent-color --warn-color Spacing:\n--border-radius --extra-spacing (adds equal distance from sides and between checkbox and label) --label-spacing (“base” distance from checkbox and label) Additionally, you can change the following CSS properties:\ndisplay (defaults to inline-block, set to block together with height: 100%; to “stretch” widget) font-size (defaults to 1rem, change to “scale” widget) Check few ready-made examples of using these properties here.","data-theme#\u003ccode\u003edata-theme\u003c/code\u003e":"TIP: Use theme toggle on this website to check how the widget will look like\nlight theme dark theme","events-and-callbacks#Events and Callbacks":"Element, where private-captcha class is set, will receive various lifecycle events (alternative to Callbacks). All events receive a detail parameter with widget (Captcha Object) and element properties. As an alternative, you can set data attributes with JavaScript handlers (all callbacks receive a single argument which is the Captcha Object itself).\nEvent Callback Description privatecaptcha:init data-init-callback Widget has received a new puzzle to solve (possibly after previous puzzle expiration). privatecaptcha:start data-started-callback Captcha started solving the puzzle. privatecaptcha:finish data-finished-callback Puzzle has been solved. You can use this callback to enable the form submit button. privatecaptcha:error data-errored-callback Puzzle endpoint is not reachable or puzzle solving has failed","example#Example":"CallbackEvent HTML:\nindex.html\u003cform\u003e \u003cdiv class=\"private-captcha\" data-finished-callback=\"onCaptchaSolved\"\u003e \u003c/div\u003e \u003c/form\u003e Javascript:\nscript.jsfunction onCaptchaSolved(widget) { console.log('Solved!'); } HTML:\nindex.html\u003cform\u003e \u003cdiv class=\"private-captcha\" id=\"myCaptchaWidget\"\u003e \u003c/div\u003e \u003c/form\u003e Javascript:\nscript.jsconst captchaElement = document.getElementById('myCaptchaWidget'); captchaElement.addEventListener('privatecaptcha:finish', (event) =\u003e console.log(event.detail.element));","explicit-rendering#Explicit rendering":"All the above assumed that when you include the JavaScript privatecaptcha.js, it automatically initializes all of the elements with CSS class private-captcha. However, it’s possible to omit that and instead do it manually in JavaScript.\nTo achieve that, you need to add parameter ?render=explicit to the script include:\nindex.html@@ -18,7 +18,13 @@ - + Then, you can use function privateCaptcha.render(htmlElement, options) to explicitly render captcha widget. options parameter allows to set properties with the same names as data-attributes above, taking into account the naming convention .","notes-and-examples#Notes and examples":""},"title":"Widget options"},"/docs/tutorials/":{"data":{"":"Here you can find tutorials with code examples that you can copy and paste.\nComplete example Invisible captcha reCAPTCHA migration Widget customization"},"title":"Tutorials"},"/docs/tutorials/complete-example/":{"data":{"":"In this tutorial we will create a simple html form, serve it locally with a simple web-server, then protect using Private Captcha and, finally, verify form submission. And all this in the comfort of your own computer (meaning, you don’t have to have a running server in the cloud).","add-captcha-widget-to-the-form#Add captcha widget to the form":"This assumes that you already have an account with Private Captcha. If you don’t, go ahead and create one .","add-captcha-widget-to-the-form-1#Add captcha widget to the form":"To integrate the widget, we need to add javascript include for privatecaptcha.js and the widget itself to the form. You can get them from the integration snippet above.\nNote\nMake sure to use your own sitekey\nindex.html + Email: + Submit If you did everything correctly, when you refresh the page (and/or restart your server), you will see the captcha widget inside your form:\nWarning\nCaptcha has a strict CORS policy and, by default, it will load only on the domain configured during property creation. Subdomains and localhost access needs to be explicitly allowed.\nIn order to make captcha widget to load on localhost domain, we need to allow it in the settings of the property you just created (this is not required if you used ngrok domain).\nHowever, currently captcha widget is not yet particularly useful as we do not take it into account when submitting the form.","add-code-to-verify-solution#Add code to verify solution":"After captcha widget has finished solving the puzzle, it adds a hidden form field with solution (defined by data-solution-field attribute).\n\u003cform\u003e \u003cinput name=\"private-captcha-solution\" type=\"hidden\" value=\"AAAAAAACAhQEAOiDAAAAAAC...IsoSTgYAAA=\"\u003e \u003c/form\u003e To verify solution we need to send a POST request with the contents of this field to /verify endpoint and check the result. This is done in the server-side handler of the form.\nWarning\nBelow we are using API directly only for demonstration purposes. Most likely you want to use of of the integration SDKs that are available for popular languages.\nNote\nMake sure to use your own API key\nDiffGo main.go@@ -1,11 +1,60 @@ ) +func checkSolution(solution, apiKey string) error { + req, err := http.NewRequest(\"POST\", \"https://api.privatecaptcha.com/verify\", strings.NewReader(solution)) + if err != nil { + return err + } + + req.Header.Set(\"X-Api-Key\", apiKey) + + resp, err := http.DefaultClient.Do(req) + if err != nil { + return err + } + defer resp.Body.Close() + + response := struct { + Success bool `json:\"success\"` + Code int `json:\"code\"` + // NOTE: other fields omitted for brevity + }{} + + if err := json.NewDecoder(resp.Body).Decode(\u0026response); err != nil { + return err + } + + if !(response.Success \u0026\u0026 response.Code == 0) { + return errors.New(\"solution is not correct\") + } + + return nil +} + func main() { + http.HandleFunc(\"POST /submit\", func(w http.ResponseWriter, r *http.Request) { + const page = `\u003c!DOCTYPE html\u003e` + captchaSolution := r.FormValue(\"private-captcha-solution\") + if err := checkSolution(captchaSolution, \"your-api-key\"); err != nil { + fmt.Fprintf(w, page, \"red\") + return + } + fmt.Fprintf(w, page, \"green\") + }) + http.HandleFunc(\"/\", func(w http.ResponseWriter, r *http.Request) { if r.URL.Path == \"/\" { http.ServeFile(w, r, \"index.html\") main.goimport ( \"encoding/json\" \"errors\" \"fmt\" \"log\" \"net/http\" \"strings\" ) func checkSolution(solution, apiKey string) error { req, err := http.NewRequest(\"POST\", \"https://api.privatecaptcha.com/verify\", strings.NewReader(solution)) if err != nil { return err } req.Header.Set(\"X-Api-Key\", apiKey) resp, err := http.DefaultClient.Do(req) if err != nil { return err } defer resp.Body.Close() response := struct { Success bool `json:\"success\"` Code int `json:\"code\"` // NOTE: other fields omitted for brevity }{} if err := json.NewDecoder(resp.Body).Decode(\u0026response); err != nil { return err } if !(response.Success \u0026\u0026 response.Code == 0) { return errors.New(\"solution is not correct\") } return nil } func main() { http.HandleFunc(\"POST /submit\", func(w http.ResponseWriter, r *http.Request) { const page = `\u003c!DOCTYPE html\u003e` captchaSolution := r.FormValue(\"private-captcha-solution\") if err := checkSolution(captchaSolution, \"your-api-key\"); err != nil { fmt.Fprintf(w, page, \"red\") return } fmt.Fprintf(w, page, \"green\") }) // .... }","basic-webpage-and-server#Basic webpage and server":"./ index.html main.go Create a simple page with a form element in the middle of the page.\nindex.html\u003c!DOCTYPE html\u003e \u003chtml lang=\"en\"\u003e \u003chead\u003e \u003ctitle\u003ePrivate Captcha Example\u003c/title\u003e \u003cstyle\u003e body { display:flex; flex-direction: column; min-height: 100vh; } form { max-width: 32rem; margin: auto; display: flex; flex-direction: column; gap: 20px; border: 1px #ccc solid; padding: 20px; } \u003c/style\u003e \u003c/head\u003e \u003cbody\u003e \u003cdiv style=\"display: flex; flex: 1 1 0%\"\u003e \u003cform action='/submit' method=\"POST\"\u003e \u003clabel\u003e Email: \u003c/label\u003e \u003cinput type=\"email\" name=\"email\" placeholder=\"Email address\" required /\u003e \u003cbutton id=\"formSubmit\" type=\"submit\" disabled\u003e Submit \u003c/button\u003e \u003c/form\u003e \u003c/div\u003e \u003c/body\u003e \u003c/html\u003e And a web-server that will serve it (Go is used here as an example).\nGo main.gopackage main import ( \"log\" \"net/http\" ) func main() { http.HandleFunc(\"/\", func(w http.ResponseWriter, r *http.Request) { if r.URL.Path == \"/\" { http.ServeFile(w, r, \"index.html\") return } // Return 404 for any other paths http.NotFound(w, r) }) if err := http.ListenAndServe(\":8081\", nil); err != nil { log.Fatal(err) } } You can run it using go run main.go and open http://localhost:8081/ in the browser.\nHere’s how it looks like in Firefox:\n(optional) Making this server available publicly We can use ngrok for this purpose, but you can use any compatible solution, such as CloudFlare Tunnel or even reverse SSH tunnel from your own server.\n# run ngrok to our previously exposed port 8081 ngrok http 8081 This will give you a public domain, in this case, https://27ca-193-138-7-216.ngrok-free.app. You can verify that it’s working by opening it from your terminal.\nYou can use this domain as a property domain below.","client-side#Client-side":"In our simple web-page, let’s add a JavaScript function to enable the “Submit” button when captcha is solved.\nDiffCode index.html@@ -18,7 +18,13 @@ padding: 20px; } + index.html\u003cscript type=\"text/javascript\"\u003e function onCaptchaSolved() { const submitButton = document.querySelector('#formSubmit'); submitButton.disabled = false; } \u003c/script\u003e and connect this function to the widget itself by adding data-finished-callback attribute:\nindex.html@@ -32,7 +32,7 @@ Email: - +","create-new-property#Create new property":"In the dashboard, click “Add new property”:\nFor a domain, enter any valid domain (if you used ngrok in the previous step, add the generated domain):\nAfter property is created, we will be presented with the integration snippet:","finale#Finale":"","full-code#Full code":"Congratulations on completing this tutorial! You can find full code in this gist .","integrating-with-private-captcha#Integrating with Private Captcha":"","server-side#Server-side":"For server-side, we need to add a handler for the form and verify captcha solution.\nTo verify captcha solutions, we need an API key. Head to the portal , open your user’s Settings, then API keys and click “Create new key”.","test-your-form#Test your form":"Now you can finally click “Submit” on your page and see if you get a “green result” in the end.\nNow, if you did everything correct, your property dashboard in portal will also show some activity.\nAnd, if you print verify response to the console, you will get this json:\n{\"success\":true,\"code\":0,\"timestamp\":\"2025-01-14T11:19:34Z\",\"origin\":\"27ca-193-138-7-216.ngrok-free.app\"}","troubleshooting#Troubleshooting":"To access browser logs you can add data-debug=\"true\" attribute to the widget and then see if there are any errors in the console.\nCaptcha verification fails (you see a red page) localhost was not allowed in the property settings for deployments, different from privatecaptcha.com, you also need to set data-puzzle-endpoint=\"https://api.your-domain.com/puzzle\" attribute"},"title":"Complete example"},"/docs/tutorials/invisible-captcha/":{"data":{"":"Invisible captcha refers to the situation when you don’t want to show captcha widget for various reasons (e.g. custom UI integraion or design restrictions).\nInvisible captcha can provide the lowest level of protection, when implemented incorrectly. Read more","demo#Demo":"You can try the above setup by clicking this button:\nSubmit","example#Example":"Here’s how a more complete example of the above looks like:\nHTMLJavascript \u003cform\u003e \u003cdiv class=\"private-captcha\" data-sitekey=\"xyz\" data-display-mode=\"hidden\" data-start-mode=\"click\" data-started-callback=\"invisibleCaptchaStarted\" data-finished-callback=\"invisibleCaptchaFinished\"\u003e \u003c/div\u003e \u003cbutton type=\"button\" onclick=\"window.privateCaptcha.autoWidget.execute()\"\u003e \u003csvg id=\"spinner\" ... /\u003e \u003csvg id=\"checkmark\" ... /\u003e Submit \u003c/button\u003e \u003c/form\u003e function invisibleCaptchaStarted() { document.getElementById('spinner').classList.remove('hidden'); document.getElementById('checkmark').classList.add('hidden'); } function invisibleCaptchaFinished(widget) { setTimeout(() =\u003e { document.getElementById('spinner').classList.add('hidden'); document.getElementById('checkmark').classList.remove('hidden'); }, 1500); setTimeout(() =\u003e { widget.reset(); document.getElementById('spinner').classList.add('hidden'); document.getElementById('checkmark').classList.add('hidden'); }, 3000); }","setup#Setup":"To permanently hide the widget, set data-display-mode attribute to hidden.","triggering-solving#Triggering solving":"By default, captcha will begin solving when any input from the parent form will receive input. For example, it will happen when you fill out input fields or click the Submit button.\nHowever, if you want to control when the solving will start, you can set data-start-mode attribute to click and trigger solving captcha using API method execute()."},"title":"Invisible captcha"},"/docs/tutorials/migrate-from-recaptcha/":{"data":{"":"You can migrate from Google reCAPTCHA “fast” using compatibility mode for server-side and client-side parts or you can fully migrate to Private Captcha.\nTo proceed with migration, in Private Captcha portal you need to get a sitekey for client-side (property integrations) and API key for backend (account settings).","client-side#Client-side":"Private Captcha offers a compatibility mode for the website integration: just add ?compat=recaptcha script parameters when you include Private Captcha script.\nindex.html@@ -18,7 +18,13 @@ - + Compatibility mode means the following:\nsolution form field will be called g-recaptcha-response instead of private-captcha-solution Private Captcha JavaScript object is available as grecaptcha global property Private Captcha looks for elements with g-recaptcha class instead of private-captcha for automatic widget rendering All compatible global APIs for reCAPTCHA like render() or getResponse() are also present Note\nPrivate Captcha offers invisible mode with execute() API too","client-side-1#Client-side":"Even without compatibility mode (above), Private Captcha offers a similar client-side API as reCAPTCHA, so migration shouldn’t cause a lot of pain.\nThings you generally will need to do:\nreplace script src address to use the Private Captcha one replace added class g-recaptcha to private-captcha for automatic/implicit rendering (the default) replace usage of grecaptcha global object (if any) to privateCaptcha change stub sitekeys for testing, if you have any You can check full widget documentation for front-end details.","explicit-rendering#Explicit rendering":"By default, when you include the client script, Private Captcha initializes all elements that have g-recaptcha class attached (that is, in reCAPTCHA compatibility mode).\nHowever, you can also explicitly render captcha elements using window.grecaptcha.render(htmlElement, options) API. To do so, add another argument to Javascript script include: render=explicit and then explicitly call render() for all elements that you need.","fast-migration#Fast migration":"“Fast” migration makes it possible to migrate with absolutely minimal amount of changes to front-end or backend-end to use your existing integration code.","full-migration#Full migration":"Note\nFull migration is recommended as it is quite easy and it uses more efficient codepaths.\nTo migrate from reCAPTCHA completely, you need to rely on Private Captcha semantics on the client-side and use one of the pre-built integrations on the server side.","server-side#Server-side":"Private Captcha offers reCAPTCHA compatible API endpoint /siteverify, that you can use like this:\n- https://www.google.com/recaptcha/api/siteverify + https://api.privatecaptcha.com/siteverify Warning\nGoogle reCAPTCHA also supports GET request type to /siteverify endpoint (in addition to POST), but Private Captcha only supports POST\nBy default endpoint returns responses in reCAPTCHA v2 format. In case you are using reCAPTCHA v3, you need to add an additional header X-Captcha-Compat-Version: rcV3 to your requests and response will follow v3-compatible API.","server-side-1#Server-side":"Private Captcha offers a lot of pre-built integrations so your backend technology is very likely covered. If not, you can rely on OpenAPI spec to generate your client (or write one yourself, as it’s doing only a single POST request to an API endpoint)."},"title":"Migrate from reCAPTCHA"},"/docs/tutorials/widget-customization/":{"data":{"":"This tutorial is mostly a collection of visual changes to the widget through data-styles attribute.","accent-colors#Accent colors":"Here’s how to make a red widget. You need to override --border (obviously), then --accent-color, --pie-color and --checkbox-hover-color.\nWidgetHTML \u003cform\u003e \u003cdiv class=\"private-captcha\" data-styles=\"--border: 1px solid #cd1811; --accent-color: #cd1811; --pie-color: #fdb8b7; --checkbox-hover-color: #feeded;\"\u003e \u003c/div\u003e \u003c/form\u003e","border-customization#Border customization":"Border color is customized with --border variable (a proxy to border CSS property) and border radius is customized with --border-radius\nWidgetHTML \u003cform\u003e \u003cdiv class=\"private-captcha\" data-styles=\"--border-radius: 1rem; --border: 1px dashed blue;\"\u003e \u003c/div\u003e \u003c/form\u003e","box-shadow#Box shadow":"Make sure that container’s parent (or form itself) has the same border-radius so there’re no visual conflicts. Also make sure the container does not have overflow: hidden.\nWidgetHTML \u003cform\u003e \u003cdiv class=\"private-captcha\" data-styles=\"box-shadow: 0 20px 25px -5px rgb(0 0 0 / 0.1), 0 8px 10px -6px rgb(0 0 0 / 0.1); --border-radius: 0.5rem;\"\u003e \u003c/div\u003e \u003c/form\u003e","even-more-customization#Even more customization":"For absolutely custom visualization, you can make Private Captcha widget “invisible” and make your own visualizations based on widget’s callbacks and/or events. You can see an example of it in the linked page.","extra-spacing#Extra spacing":"Depending on preferred widget size, you might want to add more horizontal padding between sides and checkbox and logo. You can achieve that using --extra-spacing.\nWidgetHTML \u003cform style=\"width: 400px\"\u003e \u003cdiv class=\"private-captcha\" data-styles=\"display: block; --extra-spacing: 1.5rem;\"\u003e \u003c/div\u003e \u003c/form\u003e","full-width-widget#Full-width widget":"The only thing you need to do is to add display: block to data-styles (and make sure form itself is wide enough).\nWidgetHTML \u003cform\u003e \u003cdiv class=\"private-captcha\" data-styles=\"display: block;\"\u003e \u003c/div\u003e \u003c/form\u003e","large-widget#Large widget":"There’re 2 things you can do: changing font-size scales everything inside the widget and stretching widget itself is done with display attribute (which by default is inline-block).\nWidgetHTML \u003cform style=\"width: 500px; height: 160px;\"\u003e \u003cdiv class=\"private-captcha\" style=\"height: 100%\" data-styles=\"display: block; height: 100%; font-size: 24px;\"\u003e \u003c/div\u003e \u003c/form\u003e","responsive-size#Responsive size":"For mobile clients we want to show a smaller widget. We can achieve this using font-size and clamp CSS built-in to have smth like font-size: clamp(18px, 4vw, 20px). Trick can be also used to things like --extra-spacing.\nWidgetHTML \u003cform\u003e \u003cdiv class=\"private-captcha\" data-styles=\"font-size: clamp(18px, 4vw, 20px); --extra-spacing: clamp(0.025rem, 2vw, 0.25rem);\"\u003e \u003c/div\u003e \u003c/form\u003e"},"title":"Widget customization"},"/glossary":{"data":{},"title":"Glossary"}}